[
  {
    "input": "The ICC has established that 'unwillingness' encompasses a range of state behaviors that indicate a lack of genuine intent to bring perpetrators to justice. The Court has interpreted unwillingness to include: 1. Deliberate actions to shield perpetrators from criminal responsibility; 2. Procedural delays inconsistent with the intent to bring someone to justice; 3. Lack of independence or impartiality in proceedings; 4. Failure to genuinely investigate or prosecute the same case as before the ICC.",
    "output": "The ICC has established that 'unwillingness' means state behaviors lacking genuine intent to bring perpetrators to justice. The Court interprets unwillingness as: 1. Actions shielding perpetrators; 2. Delays inconsistent with justice; 3. Lack of independent proceedings; 4. Failure to investigate or prosecute the same case.",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive phrases like 'deliberate actions to shield' and simplified to 'actions shielding'.",
      "Step 2: Removed 'procedural' from 'procedural delays' as it adds no precision.",
      "Step 3: Consolidated 'independence or impartiality' to 'independent proceedings' to avoid doublet.",
      "Step 4: Eliminated 'genuinely' from 'genuinely investigate' as redundant with 'genuine intent' earlier."
    ]
  },
  {
    "input": "In the Katanga case, the Trial Chamber held that 'in case of inaction, the question of unwillingness or inability does not arise; inaction on the part of a State having jurisdiction (that is, the fact that a State is not investigating or prosecuting, or has not done so) renders a case admissible before the Court'. This establishes that unwillingness only needs to be assessed when there is actual state action in the form of investigation or prosecution.",
    "output": "In the Katanga case, the Trial Chamber ruled that inaction by a State with jurisdiction makes a case admissible before the Court without assessing unwillingness or inability. This means unwillingness is only evaluated when the State actively investigates or prosecutes.",
    "technique": "Active Voice Conversion (Legal)",
    "application_steps": [
      "Step 1: Changed passive 'the question of unwillingness or inability does not arise' to active 'without assessing unwillingness or inability'.",
      "Step 2: Converted 'inaction on the part of a State having jurisdiction' to 'inaction by a State with jurisdiction'.",
      "Step 3: Simplified 'renders a case admissible before the Court' to active 'makes a case admissible before the Court'.",
      "Step 4: Rephrased passive explanation to active 'the State actively investigates or prosecutes'."
    ]
  },
  {
    "input": "In the Simone Gbagbo case, the Appeals Chamber emphasized that 'it is not sufficient to merely assert that investigations are ongoing'. A state challenging admissibility 'bears the burden of proof to show that the case is inadmissible' and must provide 'evidence with a sufficient degree of specificity and probative value'.",
    "output": "In the Simone Gbagbo case, the Appeals Chamber stressed that states cannot just claim ongoing investigations. A state challenging admissibility must prove the case is inadmissible with specific and probative evidence.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Replaced 'assert that investigations are ongoing' with 'claim ongoing investigations'.",
      "Step 2: Changed 'bears the burden of proof to show' to 'must prove'.",
      "Step 3: Simplified 'provide evidence with a sufficient degree of specificity and probative value' to 'prove with specific and probative evidence'."
    ]
  },
  {
    "input": "The DRC's unwillingness was evidenced by: The state's own referral of the situation to the ICC; The state's statement that it was not investigating the Bogoro attack; The state's explicit request to the Chamber to dismiss the admissibility challenge; The DRC authorities' decision to close national proceedings to facilitate ICC jurisdiction.",
    "output": "The DRC's unwillingness, shown as 'Inaction,' was evidenced by: Inaction referred the situation to the ICC; Inaction stated it was not investigating the Bogoro attack; Inaction requested the Chamber to dismiss the admissibility challenge; Inaction closed national proceedings to enable ICC jurisdiction.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'The DRC's unwillingness' as 'Inaction' to compress repetitive references.",
      "Step 2: Replaced 'The state's own referral' with 'Inaction referred'.",
      "Step 3: Substituted 'The state's statement' with 'Inaction stated'.",
      "Step 4: Changed 'DRC authorities' decision' to 'Inaction closed' for consistency."
    ]
  },
  {
    "input": "The Pre-Trial Chamber found Libya's challenge to admissibility insufficient because: Libya 'continue[d] to face substantial difficulties in exercising fully its judicial powers across the entire territory'; The authorities were unable to secure the transfer of Gaddafi into state custody; There were 'impediments to obtain the necessary evidence, and secure legal representation for Mr Gaddafi'.",
    "output": "Pre-Trial Chamber find Libya challenge admissibility insufficient. Libya face difficulties exercise judicial powers territory. Authorities unable secure Gaddafi custody. Impediments obtain evidence, secure legal representation Gaddafi.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'The' from 'The Pre-Trial Chamber'.",
      "Step 2: Omitted auxiliary verbs like 'were' in 'were unable'.",
      "Step 3: Dropped prepositions like 'in' and 'to' in 'in exercising' and 'to obtain'.",
      "Step 4: Eliminated pronouns like 'its' in 'its judicial powers'."
    ]
  },
  {
    "input": "The Chamber found that Côte d'Ivoire had not demonstrated it was investigating the same case, noting: The state failed to provide 'evidence with a sufficient degree of specificity and probative value'; It was not sufficient to provide 'a mere assurance that the national ongoing investigation covers the same conduct'.",
    "output": "Chamber found Côte d'Ivoire not investigate same case. State failed provide specific evidence. Assurance national investigation covers conduct not sufficient.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped modifiers like 'had not demonstrated it was' to focus on 'not investigate'.",
      "Step 2: Reduced 'failed to provide evidence with a sufficient degree of specificity and probative value' to 'failed provide specific evidence'.",
      "Step 3: Simplified 'a mere assurance that the national ongoing investigation covers the same conduct' to 'assurance national investigation covers conduct'."
    ]
  },
  {
    "input": "This criterion focuses on the intent behind national proceedings. The language 'for the purpose of shielding' indicates that the Court must assess the subjective motivation of state authorities. This criterion has been interpreted to encompass situations where 'deficient practice emerges as part of a broader policy intended to shield perpetrators and maintain a climate of impunity'.",
    "output": "This criterion focuses on intent. 'Shielding' language means Court assesses state motivation. Deficient practice part of policy shields perpetrators, maintains impunity.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'This criterion focuses...' into 'This criterion focuses on intent.'",
      "Step 2: Broke 'The language 'for the purpose of shielding'...' into 'Shielding language means Court assesses state motivation.'",
      "Step 3: Divided 'This criterion has been interpreted...' into 'Deficient practice part of policy shields perpetrators, maintains impunity.'"
    ]
  },
  {
    "input": "The phrase 'unjustified delay' coupled with 'inconsistent with an intent to bring the person concerned to justice' creates a two-part test that is both objective (assessing the factual delay) and subjective (evaluating the underlying intent). In the Katanga case, the Chamber agreed, finding that although Katanga had been detained since March 2005, no substantive progress had been made in investigating the Bogoro incident.",
    "output": "The phrases 'unjustified delay' and 'inconsistent with intent to bring person to justice' create two-part test. Test objective, assess delay. Test subjective, evaluate intent. In Katanga case, Chamber finded no progress investigating Bogoro incident, though Katanga detained since March 2005.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular past tense '-ed' to 'find' as 'finded'.",
      "Step 2: Segmented complex sentence into simpler sentences for clarity.",
      "Step 3: Generalized plural 'phrases' to cover both components uniformly."
    ]
  },
  {
    "input": "'In order to determine unwillingness in a particular case, the Court shall consider, having regard to the principles of due process recognized by international law, whether... the proceedings were not or are not being conducted independently or impartially, and they were or are being conducted in a manner which, in the circumstances, is inconsistent with an intent to bring the person concerned to justice'. The reference to 'principles of due process recognized by international law' establishes an objective standard for evaluating independence and impartiality, while linking this to intent to bring someone to justice maintains a subjective component.",
    "output": "Court consider principles of due process. Court evaluate proceedings. Proceedings not conducted independently. Proceedings inconsistent with intent to bring person to justice. Due process establish objective standard. Intent maintain subjective component.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Court' as subject instead of pronouns in 'the Court shall consider'.",
      "Step 2: Replaced 'they were or are being conducted' with 'Proceedings not conducted'.",
      "Step 3: Restated 'due process recognized by international law' as 'Due process' with explicit repetition."
    ]
  },
  {
    "input": "During the Rome Conference, Lebanon noted that 'the concept of complementarity of jurisdiction between the Court and national courts must be clear. That would preclude the possibility of political manipulation in defining the willingness of a State to investigate or prosecute a crime'. This concern about potential political manipulation shows that from its inception, the term 'unwillingness' was recognized as potentially contentious and requiring careful delineation.",
    "output": "During the Rome Conference, Lebanon stated that complementarity between the Court and national courts must be clear. This clarity prevents political manipulation in defining a State's willingness to investigate or prosecute crimes. The concern about manipulation indicates that 'unwillingness' was contentious and needed careful definition from the start.",
    "technique": "Fine-Tuned Sequence-to-Sequence Simplification (AI)",
    "application_steps": [
      "Step 1: Simplified 'concept of complementarity of jurisdiction' to 'complementarity'.",
      "Step 2: Replaced 'preclude the possibility of' with 'prevents' for conciseness.",
      "Step 3: Reworded 'defining the willingness of a State' to 'defining a State's willingness' for clarity.",
      "Step 4: Condensed final sentence to maintain meaning with fewer words."
    ]
  },
  {
    "input": "The Appeals Chamber stated, 'admissibility proceedings should not be used as a mechanism or process through which a State may gradually inform the Court, over time and as its investigation progresses, as to the steps it is taking to investigate a case'. Instead, determinations of unwillingness are made based on concrete evidence of a state's genuine actions or inactions.",
    "output": "Concrete evidence of a state's genuine actions or inactions determines unwillingness. Admissibility proceedings are not a mechanism for a State to gradually inform the Court about investigation steps over time.",
    "technique": "Melodic Retrograde (Music)",
    "application_steps": [
      "Step 1: Reversed the order of sentences to start with the conclusion.",
      "Step 2: Simplified 'determinations of unwillingness are made based on' to 'determines unwillingness'.",
      "Step 3: Condensed 'through which a State may gradually inform...' to 'for a State to gradually inform'."
    ]
  },
  {
    "input": "The French term 'Manque de volonté' literally translates to 'Lack of will,' implying a deficiency in intent (volonté), which in civil law systems often relates to subjective intent (dol). This interpretation may emphasize the state’s failure to manifest genuine intent to prosecute, aligning with civil law concepts of mauvaise foi (bad faith).",
    "output": "The French term 'Manque de volonté' translates to 'Lack of will,' implying a deficiency in intent. This suggests the state fails to show genuine intent to prosecute, aligning with civil law's mauvaise foi (bad faith).",
    "technique": "Melodic Augmentation / Diminution (Music)",
    "application_steps": [
      "Step 1: Reduced rhythmic length by removing parenthetical '(volonté)' and '(dol)'.",
      "Step 2: Shortened 'which in civil law systems often relates to subjective intent' to 'implying a deficiency in intent'.",
      "Step 3: Simplified 'may emphasize the state’s failure to manifest' to 'suggests the state fails to show'."
    ]
  },
  {
    "input": "The Spanish 'Falta de voluntad' means 'Lack of willpower' or 'lack of intention' and can connote both intent and resolve, potentially broadening the scope to include systemic inertia. In Côte d’Ivoire (Gbagbo), the ICC noted that mere assurances of national proceedings without concrete actions demonstrated falta de voluntad.",
    "output": "In Côte d’Ivoire (Gbagbo), the ICC noted that mere assurances of national proceedings without concrete actions demonstrated falta de voluntad. The Spanish 'Falta de voluntad' means 'Lack of willpower' or 'lack of intention,' connoting intent, resolve, and possibly systemic inertia.",
    "technique": "Rhythmic Displacement (Music)",
    "application_steps": [
      "Step 1: Shifted the case example to start the sentence for a different metrical emphasis.",
      "Step 2: Kept the definition sentence intact but placed it after the example.",
      "Step 3: Simplified 'can connote both intent and resolve, potentially broadening the scope to include' to 'connoting intent, resolve, and possibly'."
    ]
  },
  {
    "input": "French/Spanish/Arabic versions lean toward subjective intent ('will,' 'desire'), while English/Russian/Chinese emphasize objective refusal. ICC practice resolves this by prioritizing factual indicators (e.g., shielding perpetrators, procedural irregularities) over abstract intent.",
    "output": "ICC practice prioritizes factual indicators (e.g., shielding perpetrators, procedural irregularities) over abstract intent. French/Spanish/Arabic versions focus on subjective intent ('will,' 'desire'), while English/Russian/Chinese highlight objective refusal.",
    "technique": "Active Voice Conversion (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Converted passive 'resolves this by prioritizing' to active 'prioritizes'.",
      "Step 2: Changed passive 'lean toward' to active 'focus on'.",
      "Step 3: Shifted 'emphasize' to active 'highlight' for clarity."
    ]
  },
  {
    "input": "Under Article 33 of the Vienna Convention, all authentic texts are equally valid. The ICC reconciles discrepancies by emphasizing the Statute’s object and purpose—preventing impunity—over linguistic nuances.",
    "output": "Under Article 33 of the Vienna Convention, all authentic texts hold equal validity. The ICC addresses discrepancies by focusing on the Statute’s goal—stopping impunity—rather than linguistic details.",
    "technique": "Euphemism Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Replaced 'are equally valid' with 'hold equal validity' for directness.",
      "Step 2: Changed 'reconciles discrepancies' to 'addresses discrepancies' for clarity.",
      "Step 3: Substituted 'preventing impunity' with 'stopping impunity' to avoid sanitized language.",
      "Step 4: Replaced 'nuances' with 'details' for literal description."
    ]
  },
  {
    "input": "The ICC Appeals Chamber has consistently held that 'a State that challenges the admissibility of a case bears the burden of proof to show that the case is inadmissible'. This fundamental principle has been applied uniformly across all admissibility challenges to date.",
    "output": "The ICC Appeals Chamber holds that a State challenging a case’s admissibility must prove it is inadmissible. This principle applies uniformly across all challenges.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'has consistently held' to 'holds' to eliminate verbose construction.",
      "Step 2: Simplified 'bears the burden of proof to show that' to 'must prove'.",
      "Step 3: Condensed 'fundamental principle has been applied uniformly across all admissibility challenges to date' to 'principle applies uniformly across all challenges'."
    ]
  },
  {
    "input": "The Court has established a two-step analysis for determining admissibility: 1. Whether there is an ongoing investigation or prosecution of the same case at the national level; 2. If such proceedings exist, whether they are vitiated by unwillingness or inability to genuinely carry out proceedings. The Appeals Chamber has clarified that these steps are 'intimately and inextricably linked' and may rely on the same considerations.",
    "output": "pointcut execution(* determineAdmissibility(..)) {\n  step1: checkOngoingInvestigationOrProsecution(sameCase, nationalLevel);\n  step2: if(proceedingsExist) checkUnwillingnessOrInability(genuineProceedings);\n  note: stepsLinked(intimately, inextricably, sameConsiderations);\n}",
    "technique": "Pointcut Definition (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Defined a pointcut for the admissibility determination process.",
      "Step 2: Mapped step 1 to a method checking for ongoing national investigation/prosecution.",
      "Step 3: Mapped step 2 to a conditional check for unwillingness/inability.",
      "Step 4: Added a note reflecting the Appeals Chamber’s clarification on linked steps."
    ]
  },
  {
    "input": "In the absence of a statutory standard of proof, the Court's jurisprudence has required 'evidence of a sufficient degree of specificity and probative value'. This standard was more precisely defined in the Kenya admissibility challenges, emphasizing the need for 'concrete evidence of ongoing investigations' rather than mere promises of future action.",
    "output": "class EvidenceStandard {\n  void requireEvidence() {\n    return decorateWith('specificity', 'probativeValue');\n  }\n}\nclass KenyaChallenge extends EvidenceStandard {\n  void requireEvidence() {\n    return decorateWith('concreteEvidence', 'ongoingInvestigations');\n  }\n}",
    "technique": "Decorator Pattern (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Created a base EvidenceStandard class for the general evidence requirement.",
      "Step 2: Defined a method requiring 'specificity' and 'probativeValue'.",
      "Step 3: Extended with KenyaChallenge class to add 'concreteEvidence' and 'ongoingInvestigations'.",
      "Step 4: Used decoration to enhance the base requirement with specific Kenya standards."
    ]
  },
  {
    "input": "The 'same person/substantially same conduct' test has evolved through the Court's jurisprudence into the cornerstone of admissibility determinations. This test requires that domestic proceedings must target both: The same person under investigation by the ICC, and Substantially the same conduct alleged in the ICC proceedings. 'Substantially' acknowledges that national investigations need not 'necessarily match exactly all of the features of the ICC's investigation or prosecution'.",
    "output": "fork {\n  task1: targetSamePerson(iccInvestigation, domesticProceedings);\n  task2: targetSubstantiallySameConduct(iccAllegations, domesticProceedings);\n}\njoin {\n  result: combine(task1, task2, allowMinorDifferences);\n}",
    "technique": "Fork-Join (Concurrency)",
    "application_steps": [
      "Step 1: Split the test into two parallel tasks: checking same person and same conduct.",
      "Step 2: Assigned task1 to verify the same person in domestic and ICC proceedings.",
      "Step 3: Assigned task2 to verify substantially same conduct, allowing minor differences.",
      "Step 4: Joined results to form the admissibility determination."
    ]
  },
  {
    "input": "The term 'genuinely' in Article 17 restricts the class of national proceedings that require deference from the ICC. The ICC's informal expert paper defines 'genuine' as 'having the supposed character, not sham or feigned'. This interpretation highlights that the term connotes 'a certain basic level of objective quality'.",
    "output": "pipeline {\n  stage1: restrictProceedings(genuinely, article17);\n  stage2: defineGenuine(notSham, notFeigned);\n  stage3: highlightQuality(basicObjectiveLevel);\n}",
    "technique": "Pipeline (Concurrency)",
    "application_steps": [
      "Step 1: Created a pipeline with three stages for processing the term 'genuinely'.",
      "Step 2: Stage1 restricts proceedings based on Article 17’s 'genuinely' requirement.",
      "Step 3: Stage2 defines 'genuine' as not sham or feigned per the expert paper.",
      "Step 4: Stage3 highlights the basic objective quality connotation."
    ]
  }
] [
  {
    "input": "The Kenya admissibility challenges, representing the most documented unsuccessful cases, failed primarily because the Government of Kenya did not provide 'concrete evidence' that it was investigating the same cases as the ICC. The Chamber found 'a situation of inactivity,' with claims undermined by a lack of specific investigative documentation and reliance on 'promises for future investigations'.",
    "output": "The Kenya admissibility challenges failed because Kenya did not provide concrete evidence of investigating the same cases as the ICC. The Chamber found inactivity, with claims weakened by missing specific documentation and reliance on future investigation promises.",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Removed 'representing the most documented unsuccessful cases' as it adds no precision.",
      "Step 2: Simplified 'the Government of Kenya did not provide 'concrete evidence' that it was' to 'Kenya did not provide concrete evidence of'.",
      "Step 3: Consolidated 'a situation of inactivity' to 'inactivity' for brevity.",
      "Step 4: Shortened 'undermined by a lack of specific investigative documentation and reliance on 'promises for future investigations'' to 'weakened by missing specific documentation and reliance on future investigation promises'."
    ]
  },
  {
    "input": "The Al-Senussi case represents a successful admissibility challenge, demonstrating that the Court's determinations are highly fact-specific. Libya provided detailed documentation of ongoing domestic proceedings against Al-Senussi, including charges for crimes under Libyan law linked to the 2011 uprising, and demonstrated 'concrete and progressive steps' in investigations.",
    "output": "In the Al-Senussi case, Libya successfully challenged admissibility. Libya documented ongoing domestic proceedings against Al-Senussi, charged crimes under Libyan law from the 2011 uprising, and showed concrete investigative steps.",
    "technique": "Active Voice Conversion (Legal)",
    "application_steps": [
      "Step 1: Changed passive 'represents a successful admissibility challenge' to active 'successfully challenged admissibility'.",
      "Step 2: Converted 'Libya provided detailed documentation of ongoing domestic proceedings' to active 'Libya documented ongoing domestic proceedings'.",
      "Step 3: Simplified 'demonstrated 'concrete and progressive steps' in investigations' to active 'showed concrete investigative steps'."
    ]
  },
  {
    "input": "ICC Chambers assess the status of national proceedings—whether ongoing, suspended, completed, or planned—'at the time of their admissibility determination'. This standard ensures the ICC's evaluation reflects the current state of national efforts, emphasizing that planned or future proceedings are generally insufficient unless concrete steps are evident at the time of assessment.",
    "output": "ICC Chambers evaluate national proceedings at admissibility determination time. Chambers check if proceedings are ongoing, suspended, completed, or planned. Evaluation reflects current national efforts. Planned proceedings need concrete steps to suffice.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'assess the status of' to 'evaluate' to use an action verb.",
      "Step 2: Replaced 'admissibility determination' with 'admissibility determination time' to clarify action context.",
      "Step 3: Converted 'ensures the ICC's evaluation reflects' to 'Evaluation reflects' to avoid nominalization.",
      "Step 4: Simplified 'are generally insufficient unless concrete steps are evident' to 'need concrete steps to suffice'."
    ]
  },
  {
    "input": "Article 17(3) of the Rome Statute provides the definition of inability for the purposes of determining admissibility: 'In order to determine inability in a particular case, the Court shall consider whether, due to a total or substantial collapse or unavailability of its national judicial system, the State is unable to obtain the accused or the necessary evidence and testimony or otherwise unable to carry out its proceedings.' This provision establishes a two-pronged test, requiring the cumulative satisfaction of both a cause and an effect.",
    "output": "Inability, defined as 'Systemic Failure,' means a State cannot obtain the accused, evidence, or testimony due to a collapsed or unavailable judicial system. Article 17(3) of the Rome Statute requires Systemic Failure to meet a two-pronged test of cause and effect for admissibility.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'inability' as 'Systemic Failure' to compress repetitive references.",
      "Step 2: Replaced 'total or substantial collapse or unavailability of its national judicial system' with 'collapsed or unavailable judicial system'.",
      "Step 3: Shortened 'the State is unable to obtain the accused or the necessary evidence and testimony or otherwise unable to carry out its proceedings' to 'State cannot obtain the accused, evidence, or testimony'.",
      "Step 4: Condensed 'establishes a two-pronged test, requiring the cumulative satisfaction of both a cause and an effect' to 'requires Systemic Failure to meet a two-pronged test of cause and effect'."
    ]
  },
  {
    "input": "The inability must stem from either a 'total or substantial collapse' or the 'unavailability' of the state's national judicial system, constituting 'The Cause.' As a consequence of this systemic condition, the state must be functionally incapable in one of three ways: (i) 'unable to obtain the accused,' (ii) 'unable to obtain the necessary evidence and testimony,' or (iii) 'otherwise unable to carry out its proceedings,' defining 'The Effect.'",
    "output": "Inability stem collapse unavailability judicial system. State incapable obtain accused, obtain evidence testimony, carry proceedings.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'the' from 'the state's national judicial system'.",
      "Step 2: Omitted auxiliary verbs like 'must' in 'must stem'.",
      "Step 3: Dropped prepositions like 'of' and 'in' in 'of the state' and 'in one of three ways'.",
      "Step 4: Eliminated conjunctions like 'or' in 'total or substantial collapse'."
    ]
  },
  {
    "input": "Crucially, Article 17(3) mandates a causal link, indicated by the phrase 'due to.' The Court must establish that the specific functional incapacity (the effect) is a direct result of the systemic condition (the cause – collapse or unavailability) of the national judicial system.",
    "output": "Article 17(3) mandates causal link. Court establish functional incapacity result systemic condition.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'indicated by the phrase 'due to'' to focus on 'causal link'.",
      "Step 2: Reduced 'must establish that the specific functional incapacity (the effect) is a direct result' to 'establish functional incapacity result'.",
      "Step 3: Simplified 'systemic condition (the cause – collapse or unavailability) of the national judicial system' to 'systemic condition'."
    ]
  },
  {
    "input": "A general finding of systemic weakness, even amounting to substantial collapse or partial unavailability, is not, in itself, sufficient to declare a case admissible on grounds of inability. The assessment must be case-specific, requiring that the identified systemic failure directly prevents the state from taking necessary actions in relation to the particular case being considered for admissibility.",
    "output": "Systemic weakness not sufficient declare case admissible. Assessment case-specific. Systemic failure prevent state actions case.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'A general finding of systemic weakness...' into 'Systemic weakness not sufficient declare case admissible.'",
      "Step 2: Broke 'The assessment must be case-specific' into a standalone sentence.",
      "Step 3: Divided 'requiring that the identified systemic failure...' into 'Systemic failure prevent state actions case.'"
    ]
  },
  {
    "input": "Key terms central to the inability test – 'total collapse,' 'substantial collapse,' and 'unavailability' – are not defined within the Rome Statute or its associated instruments. This inherent ambiguity necessitates that ICC Chambers interpret and apply these terms on a case-by-case basis, leading to the gradual development of jurisprudence.",
    "output": "Key terms 'total collapse,' 'substantial collapse,' 'unavailability' not defined Rome Statute. ICC Chambers interpreted apply terms case-by-case. Jurisprudence developed gradually.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular past tense '-ed' to 'interpret' as 'interpreted'.",
      "Step 2: Generalized 'necessitates that ICC Chambers interpret and apply' to 'ICC Chambers interpreted apply'.",
      "Step 3: Simplified 'leading to the gradual development of jurisprudence' to 'Jurisprudence developed gradually'."
    ]
  },
  {
    "input": "'Total collapse' represents the most extreme form of inability, typically associated with 'failed state' scenarios where the fundamental structures of governance, including the judicial system, have disintegrated. 'Substantial collapse' signifies a situation where the national judicial system, while perhaps partially functional, has suffered such significant degradation that it is incapable of genuinely investigating or prosecuting the specific case before the Court.",
    "output": "Total collapse is extreme inability. Total collapse linked to failed state scenarios. Fundamental structures disintegrated. Substantial collapse means judicial system degraded. Judicial system incapable investigate prosecute case.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Total collapse' as subject in 'Total collapse is extreme inability' and 'Total collapse linked'.",
      "Step 2: Restated 'judicial system' explicitly in 'Substantial collapse means judicial system degraded'.",
      "Step 3: Repeated 'Judicial system' in 'Judicial system incapable investigate prosecute case'."
    ]
  },
  {
    "input": "In the Gaddafi case, Pre-Trial Chamber I found Libya unable to genuinely carry out the investigation, citing authorities' difficulties in fully exercising judicial powers across the entire territory, which pointed towards substantial collapse or unavailability. Conversely, in the Al-Senussi case involving the same state, the Chamber found Libya able to proceed, determining that acknowledged security challenges and deficiencies did not rise to the level of inability for that specific case.",
    "output": "In the Gaddafi case, Pre-Trial Chamber I ruled Libya could not investigate genuinely due to difficulties exercising judicial powers, indicating substantial collapse. In the Al-Senussi case, the Chamber ruled Libya could investigate, as security challenges did not constitute inability.",
    "technique": "Fine-Tuned Sequence-to-Sequence Simplification (AI)",
    "application_steps": [
      "Step 1: Simplified 'found Libya unable to genuinely carry out the investigation' to 'ruled Libya could not investigate genuinely'.",
      "Step 2: Condensed 'citing authorities' difficulties in fully exercising judicial powers across the entire territory' to 'due to difficulties exercising judicial powers'.",
      "Step 3: Shortened 'determining that acknowledged security challenges and deficiencies did not rise to the level of inability' to 'as security challenges did not constitute inability'."
    ]
  },
  {
    "input": "Article 17(3) presents 'unavailability of its national judicial system' as an alternative cause of inability, distinct from 'collapse'. This term encompasses both physical unavailability, where the system physically does not exist or cannot be accessed, and legal unavailability, where legal barriers prevent genuine investigation or prosecution.",
    "output": "Legal unavailability, physical unavailability, distinct from collapse, cause inability. Article 17(3) presents unavailability judicial system.",
    "technique": "Melodic Retrograde (Music)",
    "application_steps": [
      "Step 1: Reversed sentence order to start with the definition of unavailability.",
      "Step 2: Simplified 'encompasses both physical unavailability... and legal unavailability' to 'Legal unavailability, physical unavailability'.",
      "Step 3: Condensed 'where legal barriers prevent genuine investigation or prosecution' to 'cause inability'."
    ]
  },
  {
    "input": "Legal Unavailability arises when the judicial system, though potentially operational, faces legal barriers that prevent it from genuinely investigating or prosecuting the specific case before the ICC. Examples include the absence of domestic legislation criminalizing the specific conduct, national laws granting immunity from prosecution, or statutes of limitation under national law that bar prosecution for international crimes.",
    "output": "Legal Unavailability occurs when the judicial system faces barriers preventing genuine investigation or prosecution. Examples are missing legislation, immunity laws, or statutes of limitation barring prosecution.",
    "technique": "Melodic Augmentation / Diminution (Music)",
    "application_steps": [
      "Step 1: Shortened 'arises when the judicial system, though potentially operational, faces legal barriers' to 'occurs when the judicial system faces barriers'.",
      "Step 2: Reduced 'prevent it from genuinely investigating or prosecuting the specific case before the ICC' to 'preventing genuine investigation or prosecution'.",
      "Step 3: Simplified examples list by removing 'domestic' and 'under national law' for brevity."
    ]
  },
  {
    "input": "The concept of legal unavailability is particularly significant as it allows the ICC to assert jurisdiction not only when a state's judicial system is physically broken, but also when its legal framework itself creates impunity for international crimes. This ensures the Court can intervene against impunity created by legal design, not just physical failure.",
    "output": "Legal unavailability allows ICC jurisdiction when legal framework creates impunity. ICC intervenes against legal design impunity, not only physical system failure.",
    "technique": "Rhythmic Displacement (Music)",
    "application_steps": [
      "Step 1: Shifted focus to start with 'Legal unavailability allows' for metrical shift.",
      "Step 2: Condensed 'assert jurisdiction not only when a state's judicial system is physically broken' to 'jurisdiction when legal framework creates impunity'.",
      "Step 3: Simplified 'ensures the Court can intervene against impunity created by legal design, not just physical failure' to 'intervenes against legal design impunity, not only physical system failure'."
    ]
  },
  {
    "input": "Regarding 'Unable to Obtain the Accused,' the primary consideration is whether the state has effective custody and control over the suspect. If the accused is securely held by state authorities, this ground for inability is generally not met, as emphasized in the Al-Senussi decision.",
    "output": "State must hold accused securely. If state controls suspect, inability not met, as Al-Senussi decision shows.",
    "technique": "Active Voice Conversion (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Changed passive 'whether the state has effective custody and control' to active 'State must hold accused securely'.",
      "Step 2: Converted 'this ground for inability is generally not met' to active 'inability not met'.",
      "Step 3: Simplified 'as emphasized in the Al-Senussi decision' to 'as Al-Senussi decision shows'."
    ]
  },
  {
    "input": "Inability to obtain the accused can also arise if the suspect is outside the state's territory and the state lacks the legal mechanisms or practical ability to secure their surrender. The initial admissibility finding in the Uganda situation partly rested on the state's failure to arrest LRA leaders who remained at large.",
    "output": "Inability to obtain accused occurs when suspect is outside state territory and state cannot secure surrender. Uganda's admissibility finding rested on failure to arrest LRA leaders at large.",
    "technique": "Euphemism Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Replaced 'lacks the legal mechanisms or practical ability' with 'cannot secure' for directness.",
      "Step 2: Changed 'partly rested on the state's failure' to 'rested on failure' to avoid softened language.",
      "Step 3: Simplified 'who remained at large' to 'at large' for literal clarity."
    ]
  },
  {
    "input": "The assessment for 'Unable to Obtain Necessary Evidence and Testimony' is highly dependent on the practical realities of conducting investigations in challenging environments. The prevailing security situation is frequently a critical factor, preventing investigators from accessing crime scenes or making it impossible for witnesses to travel safely to testify. The absence or inadequacy of witness protection programs can also render a state unable to obtain crucial testimony.",
    "output": "Assessment for evidence testimony depends practical realities investigations. Security situation prevents crime scene access, witness travel. Witness protection absence renders state unable testimony.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'highly dependent on the' from 'highly dependent on the practical realities' for conciseness.",
      "Step 2: Simplified 'prevailing security situation is frequently a critical factor' to 'Security situation prevents'.",
      "Step 3: Condensed 'absence or inadequacy of witness protection programs can also render a state unable to obtain crucial testimony' to 'Witness protection absence renders state unable testimony'."
    ]
  },
  {
    "input": "The 'otherwise unable to carry out proceedings' clause in Article 17(3) provides flexibility, capturing functional incapacities that prevent genuine proceedings but may not fall neatly under other categories. Potential factors considered under this limb include severe administrative deficiencies, a critical shortage of essential resources, or a systemic inability to guarantee fundamental due process, such as access to competent legal representation.",
    "output": "pointcut execution(* carryOutProceedings(..)) {\n  checkFlexibility(otherwiseUnable, article17_3);\n  includeFactors(adminDeficiencies, resourceShortage, dueProcessFailure);\n}",
    "technique": "Pointcut Definition (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Defined a pointcut for the 'otherwise unable' clause in Article 17(3).",
      "Step 2: Specified checking flexibility for functional incapacities.",
      "Step 3: Included specific factors like administrative deficiencies and resource shortages."
    ]
  },
  {
    "input": "Quantitative factors refer to specific, often numerically expressible, data points related to the resources, infrastructure, and performance of a national judicial system. While providing objective data points, these are rarely sufficient in themselves and must be interpreted within a broader qualitative framework to determine their actual bearing on a state's inability.",
    "output": "class JudicialSystemAnalysis {\n  void analyzeQuantitativeFactors() {\n    return decorateWith('resources', 'infrastructure', 'performance');\n  }\n}\nclass InabilityAssessment extends JudicialSystemAnalysis {\n  void analyzeQuantitativeFactors() {\n    return decorateWith('resources', 'infrastructure', 'performance', 'qualitativeContext');\n  }\n}",
    "technique": "Decorator Pattern (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Created a base JudicialSystemAnalysis class for quantitative factors.",
      "Step 2: Defined a method analyzing resources, infrastructure, and performance.",
      "Step 3: Extended with InabilityAssessment to add qualitative context.",
      "Step 4: Used decoration to enhance analysis with broader framework."
    ]
  },
  {
    "input": "Qualitative factors encompass non-numerical, judgment-based evaluations of the nature, effectiveness, fairness, and overall capacity of the national judicial system, particularly in the context of international crimes. These include assessments of overall system functionality, genuineness of proceedings, adherence to due process, and the impact of the security environment.",
    "output": "fork {\n  task1: evaluateNatureEffectiveness(judicialSystem);\n  task2: assessFairnessCapacity(internationalCrimes);\n}\njoin {\n  result: combine(task1, task2, includeFunctionalityDueProcessSecurity);\n}",
    "technique": "Fork-Join (Concurrency)",
    "application_steps": [
      "Step 1: Split evaluation into two parallel tasks: nature/effectiveness and fairness/capacity.",
      "Step 2: Assigned task1 to evaluate nature and effectiveness of the judicial system.",
      "Step 3: Assigned task2 to assess fairness and capacity for international crimes.",
      "Step 4: Joined results, including functionality, due process, and security factors."
    ]
  },
  {
    "input": "ICC jurisprudence demonstrates a dynamic interplay where quantitative factors often serve as factual anchors, while the ultimate decision hinges on a qualitative assessment of their significance within the specific case context. The contrasting decisions in the Gaddafi and Al-Senussi cases in Libya exemplify this balance, showing how objective data points are weighed within a broader qualitative context of insecurity and systemic weakness.",
    "output": "pipeline {\n  stage1: anchorQuantitativeFactors(factualData);\n  stage2: assessQualitativeSignificance(caseContext);\n  stage3: balanceCases(gaddafi, alSenussi, insecurityWeakness);\n}",
    "technique": "Pipeline (Concurrency)",
    "application_steps": [
      "Step 1: Created a pipeline with three stages for jurisprudence analysis.",
      "Step 2: Stage1 anchors quantitative factors as factual data.",
      "Step 3: Stage2 assesses qualitative significance in case context.",
      "Step 4: Stage3 balances Gaddafi and Al-Senussi cases considering insecurity and weakness."
    ]
  }
] [
  {
    "input": "The theoretical distinction often aligns 'collapse' with physical factors rendering the system non-functional, and 'unavailability' with legal or functional impediments within a system that might otherwise exist. However, practical application demonstrates significant overlap, and the terminology might sometimes be used interchangeably or not sharply maintained in judicial reasoning.",
    "output": "Theoretical distinction align collapse physical factors, unavailability legal impediments. Practical application show overlap. Terminology used interchangeably judicial reasoning.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped modifiers like 'often' and 'that might otherwise exist' to focus on core distinction.",
      "Step 2: Reduced 'demonstrates significant overlap' to 'show overlap' to preserve agent-action.",
      "Step 3: Simplified 'might sometimes be used interchangeably or not sharply maintained' to 'used interchangeably judicial reasoning'."
    ]
  },
  {
    "input": "'Unavailability' may represent a broader concept and potentially a lower threshold for ICC intervention than 'substantial collapse'. It can encompass situations where the judicial system appears generally operational but contains specific legal flaws or functional gaps that render it incapable of genuinely prosecuting.",
    "output": "Unavailability broader concept, lower threshold ICC intervention than substantial collapse. Judicial system operational, legal flaws, functional gaps incapable prosecute genuinely.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'a' from 'a broader concept'.",
      "Step 2: Omitted auxiliary verbs like 'may' in 'may represent'.",
      "Step 3: Dropped prepositions like 'for' and 'of' in 'for ICC intervention' and 'of genuinely prosecuting'.",
      "Step 4: Eliminated conjunctions like 'but' in 'but contains'."
    ]
  },
  {
    "input": "Proving 'total or substantial collapse' likely necessitates evidence demonstrating a systemic breakdown of judicial and potentially governmental authority, such as reports on widespread institutional failure or evidence of destruction of infrastructure. Proving 'unavailability,' particularly legal unavailability, might rely on more targeted evidence like specific national laws or official documents demonstrating a lack of necessary cooperation agreements.",
    "output": "Prove total collapse, substantial collapse need evidence systemic breakdown judicial authority. Evidence show institutional failure, infrastructure destruction. Prove unavailability, legal unavailability use targeted evidence national laws, documents lack cooperation agreements.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'Proving' to 'Prove' to use an action verb.",
      "Step 2: Replaced 'necessitates evidence demonstrating' with 'need evidence show' to avoid nominalization.",
      "Step 3: Simplified 'Proving unavailability, particularly legal unavailability, might rely on' to 'Prove unavailability, legal unavailability use'."
    ]
  },
  {
    "input": "The Rome Statute establishes complementarity as a foundational principle governing the International Criminal Court's operation, explicitly recognized in the Preamble and Article 1. This principle dictates that the ICC is intended to complement, not supplant, national criminal jurisdictions. States bear the primary responsibility and right to investigate and prosecute mass atrocities committed on their territory or by their nationals.",
    "output": "Rome Statute establishes Complementarity as principle. Complementarity governs ICC operation, recognized in Preamble, Article 1. ICC complements national jurisdictions. States investigate, prosecute atrocities on territory, by nationals.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'complementarity' as 'Complementarity' to compress repetitive references.",
      "Step 2: Simplified 'foundational principle governing the International Criminal Court's operation' to 'principle governs ICC operation'.",
      "Step 3: Replaced 'intended to complement, not supplant' with 'complements' for brevity.",
      "Step 4: Condensed 'bear the primary responsibility and right to investigate and prosecute mass atrocities committed' to 'investigate, prosecute atrocities'."
    ]
  },
  {
    "input": "The term 'genuinely' in Article 17 restricts the class of national proceedings that require deference from the ICC. The ICC's informal expert paper defines 'genuine' as 'having the supposed character, not sham or feigned'. This interpretation highlights that the term connotes 'a certain basic level of objective quality'.",
    "output": "Article 17's 'genuinely' limits national proceedings requiring ICC deference. Expert paper defines 'genuine' as not sham or feigned, indicating basic objective quality.",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Removed 'The term' from 'The term genuinely' as redundant.",
      "Step 2: Simplified 'restricts the class of national proceedings that require deference from the ICC' to 'limits national proceedings requiring ICC deference'.",
      "Step 3: Condensed 'defines 'genuine' as 'having the supposed character, not sham or feigned'' to 'defines 'genuine' as not sham or feigned'.",
      "Step 4: Shortened 'highlights that the term connotes 'a certain basic level of objective quality'' to 'indicating basic objective quality'."
    ]
  },
  {
    "input": "The adverb 'genuinely' is crucial, modifying the state's action 'to carry out the investigation or prosecution' in Article 17(1)(a) and (b). Jurisprudence confirms that 'genuinely' also qualifies the inability assessment, implying the state's capacity must meet a certain minimum threshold of objective quality and sincerity. Proceedings cannot be considered 'genuine' if they are 'hopelessly inadequate,' even if the state appears willing.",
    "output": "Article 17(1)(a) and (b) use 'genuinely' to modify state action. Jurisprudence confirms 'genuinely' applies to inability assessment. State capacity must meet objective quality threshold. Proceedings not genuine if hopelessly inadequate, despite state willingness.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'The adverb 'genuinely' is crucial...' into 'Article 17(1)(a) and (b) use 'genuinely' to modify state action.'",
      "Step 2: Broke 'Jurisprudence confirms that 'genuinely' also qualifies...' into 'Jurisprudence confirms 'genuinely' applies to inability assessment.'",
      "Step 3: Divided 'implying the state's capacity must meet...' into 'State capacity must meet objective quality threshold.'",
      "Step 4: Separated 'Proceedings cannot be considered 'genuine'...' into 'Proceedings not genuine if hopelessly inadequate, despite state willingness.'"
    ]
  },
  {
    "input": "'Substantial collapse' signifies a situation where the national judicial system, while perhaps partially functional, has suffered such significant degradation that it is incapable of genuinely investigating or prosecuting the specific case before the Court. The crucial element appears to be whether the demonstrated systemic weaknesses cause the state to be unable to obtain the accused, gather necessary evidence, or otherwise carry out genuine proceedings.",
    "output": "Substantial collapse mean judicial system degraded. Judicial system incapable investigate prosecute case. Systemic weaknesses cause state unable obtain accused, gather evidence, carry proceedings.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular verb form 'mean' to 'signifies' as 'mean'.",
      "Step 2: Generalized 'has suffered such significant degradation' to 'degraded'.",
      "Step 3: Simplified 'cause the state to be unable to obtain' to 'cause state unable obtain'."
    ]
  },
  {
    "input": "The residual clause 'Otherwise Unable to Carry Out Proceedings' in Article 17(3) provides flexibility, capturing functional incapacities that prevent genuine proceedings but may not fall neatly under other categories. Potential factors considered under this limb include severe administrative deficiencies, a critical shortage of essential resources, or a systemic inability to guarantee fundamental due process, such as access to competent legal representation.",
    "output": "Residual clause is flexible. Residual clause captures incapacities preventing proceedings. Factors include deficiencies, resource shortage, inability guarantee due process.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Residual clause' as subject in 'Residual clause is flexible' and 'Residual clause captures'.",
      "Step 2: Restated 'functional incapacities that prevent genuine proceedings' as 'incapacities preventing proceedings'.",
      "Step 3: Simplified 'Potential factors considered under this limb include' to 'Factors include' with explicit subject retention."
    ]
  },
  {
    "input": "Article 17(1) of the Rome Statute lays out core grounds for inadmissibility, emphasizing the subsidiary nature of ICC jurisdiction. A case is inadmissible if it is being investigated or prosecuted by a State with jurisdiction, or if such a State has investigated and decided not to prosecute. However, this deference is conditional, allowing ICC intervention if the State is 'unwilling or unable genuinely to carry out the investigation or prosecution.'",
    "output": "Article 17(1) simplifies ICC jurisdiction. It states a case is inadmissible if a State investigates or prosecutes it, or has decided not to prosecute after investigation. ICC can intervene if the State lacks genuine willingness or ability to investigate or prosecute.",
    "technique": "Fine-Tuned Sequence-to-Sequence Simplification (AI)",
    "application_steps": [
      "Step 1: Simplified 'lays out core grounds for inadmissibility, emphasizing the subsidiary nature of ICC jurisdiction' to 'simplifies ICC jurisdiction'.",
      "Step 2: Condensed 'if it is being investigated or prosecuted by a State with jurisdiction, or if such a State has investigated and decided not to prosecute' to 'if a State investigates or prosecutes it, or has decided not to prosecute after investigation'.",
      "Step 3: Reworded 'this deference is conditional, allowing ICC intervention if the State is 'unwilling or unable genuinely to carry out'' to 'ICC can intervene if the State lacks genuine willingness or ability to investigate or prosecute'."
    ]
  },
  {
    "input": "The assessment of complementarity under Article 17 involves navigating the relationship between procedural form and substantive outcomes. Procedural Activity refers to observable actions and formal steps undertaken by a State within its legal system, such as initiating investigations or conducting trials. Substantive Justice Outcomes pertain to the quality, purpose, and potential effectiveness of national proceedings in achieving genuine accountability, assessing whether outcomes are consistent with combating impunity.",
    "output": "Complementarity assessment balances procedural form, substantive outcomes. Procedural Activity means state actions, investigations, trials. Substantive Justice Outcomes focus quality, effectiveness, accountability, combating impunity.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'The assessment of complementarity...' into 'Complementarity assessment balances procedural form, substantive outcomes.'",
      "Step 2: Broke 'Procedural Activity refers to observable actions...' into 'Procedural Activity means state actions, investigations, trials.'",
      "Step 3: Divided 'Substantive Justice Outcomes pertain to...' into 'Substantive Justice Outcomes focus quality, effectiveness, accountability, combating impunity.'"
    ]
  },
  {
    "input": "Article 17(2) provides non-exhaustive indicators of unwillingness, evaluated 'having regard to the principles of due process recognized by international law.' These include proceedings undertaken for the purpose of shielding the person from responsibility, unjustified delays inconsistent with an intent to bring justice, or proceedings not conducted independently or impartially in a manner inconsistent with such intent.",
    "output": "pointcut execution(* evaluateUnwillingness(..)) {\n  checkIndicators(dueProcess, internationalLaw);\n  includeShieldingProceedings(unjustifiedDelays, nonIndependentProceedings);\n}",
    "technique": "Pointcut Definition (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Defined a pointcut for the unwillingness evaluation process.",
      "Step 2: Specified checking indicators based on due process and international law.",
      "Step 3: Included specific indicators like shielding, delays, and non-independent proceedings."
    ]
  },
  {
    "input": "The Court developed the 'same case' or 'same person/same conduct' test to determine if national proceedings sufficiently overlap with the ICC's case, requiring analysis of both the individual(s) involved and the essential conduct. If national authorities investigate peripheral figures, distinct incidents, or characterize conduct solely as ordinary domestic crimes without addressing international criminal responsibility, the ICC may conclude the 'same case' is not genuinely investigated.",
    "output": "Court develop test same person, same conduct. Test check national proceedings overlap ICC case. National authorities investigate peripheral figures, distinct incidents, domestic crimes, ICC conclude same case not investigated genuinely.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular verb form 'develop' to 'developed' as 'develop'.",
      "Step 2: Generalized 'same case' or 'same person/same conduct' to 'same person, same conduct'.",
      "Step 3: Simplified 'requiring analysis of both the individual(s) involved and the essential conduct' to 'check national proceedings overlap ICC case'."
    ]
  },
  {
    "input": "A significant linguistic pattern in ICC jurisprudence frames procedural requirements for admissibility challenges as respecting state prerogatives, ensuring a form of 'due process' for states. The Appeals Chamber affirmed that Chambers dealing with admissibility challenges brought by an accused must invite the State concerned to submit its views. This reflects an evolving understanding that consultation with states is a procedural manifestation of sovereignty respect.",
    "output": "ICC jurisprudence pattern respects state prerogatives. Appeals Chamber affirmed Chambers invite State submit views. Consultation reflects sovereignty respect.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'A significant linguistic pattern in' to simplify to 'ICC jurisprudence pattern'.",
      "Step 2: Condensed 'frames procedural requirements for admissibility challenges as respecting' to 'respects'.",
      "Step 3: Simplified 'must invite the State concerned to submit its views' to 'invite State submit views'.",
      "Step 4: Shortened 'procedural manifestation of sovereignty respect' to 'sovereignty respect'."
    ]
  },
  {
    "input": "Sovereignty-respecting phrasing appears across ICC admissibility decisions regardless of whether the Court ultimately defers to national proceedings or asserts its own jurisdiction. Stronger or more elaborate sovereignty markers do not consistently predict a deferential outcome. The presence of elaborate sovereignty language does not correspond to an increased likelihood of deferral, as the rhetorical intensity of deference does not determine whether a case is deemed admissible or inadmissible.",
    "output": "ICC admissibility decisions use sovereignty-respecting phrasing. Court defers or asserts jurisdiction. Strong sovereignty markers not predict deferential outcome. Elaborate language not increase deferral likelihood.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'Sovereignty-respecting phrasing appears...' into 'ICC admissibility decisions use sovereignty-respecting phrasing.'",
      "Step 2: Broke 'regardless of whether the Court ultimately defers...' into 'Court defers or asserts jurisdiction.'",
      "Step 3: Divided 'Stronger or more elaborate sovereignty markers...' into 'Strong sovereignty markers not predict deferential outcome.'",
      "Step 4: Separated 'The presence of elaborate sovereignty language...' into 'Elaborate language not increase deferral likelihood.'"
    ]
  },
  {
    "input": "The Rome Statute establishing the International Criminal Court (ICC) is built upon the foundational principle of complementarity. Articulated in the Preamble and primarily operationalized through Article 17, complementarity dictates that the ICC serves as a court of last resort, intended to supplement, not supplant, national criminal jurisdictions.",
    "output": "Rome Statute establishes ICC with Complementarity. Complementarity in Preamble, Article 17. ICC supplements national jurisdictions as last resort.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'complementarity' as 'Complementarity' to compress references.",
      "Step 2: Simplified 'built upon the foundational principle of complementarity' to 'establishes ICC with Complementarity'.",
      "Step 3: Condensed 'Articulated in the Preamble and primarily operationalized through Article 17' to 'Complementarity in Preamble, Article 17'.",
      "Step 4: Shortened 'intended to supplement, not supplant, national criminal jurisdictions' to 'supplements national jurisdictions'."
    ]
  },
  {
    "input": "States bear the primary duty and right to investigate and prosecute the most serious crimes of international concern, specifically when committed on their territory or by their nationals. The ICC may only exercise its jurisdiction when national systems are 'unwilling or unable genuinely to carry out the investigation or prosecution'.",
    "output": "States investigate prosecute serious crimes territory nationals. ICC exercise jurisdiction national systems unwilling unable investigate prosecute genuinely.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'the' from 'the primary duty'.",
      "Step 2: Omitted auxiliary verbs like 'bear' in 'bear the primary duty'.",
      "Step 3: Dropped prepositions like 'of' in 'of international concern'.",
      "Step 4: Eliminated conjunctions like 'and' in 'duty and right'."
    ]
  },
  {
    "input": "The principle of complementarity stems from a dual rationale: profound respect for state sovereignty, recognizing the inherent right of states to exercise criminal jurisdiction within their borders, and pragmatic considerations of effectiveness and efficiency. National systems are often better positioned with access to evidence, witnesses, and resources.",
    "output": "Complementarity respects state sovereignty. Complementarity recognizes state right exercise jurisdiction. Complementarity considers effectiveness, efficiency. National systems access evidence, witnesses, resources.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Complementarity' as subject in 'Complementarity respects' and 'Complementarity recognizes'.",
      "Step 2: Restated 'state sovereignty' explicitly in 'Complementarity respects state sovereignty'.",
      "Step 3: Repeated 'National systems' in 'National systems access evidence, witnesses, resources'."
    ]
  },
  {
    "input": "The Office of the Prosecutor (OTP) developed interpretations emphasizing 'positive complementarity,' involving activities aimed at encouraging and facilitating genuine national proceedings. More recently, the OTP articulated a policy of 'dynamic complementarity,' seeking to balance active partnership and support for national efforts with the necessary vigilance to ensure the Court fulfills its own mandate when states fail to act genuinely.",
    "output": "class ProsecutorOffice {\n  void developComplementarity() {\n    return decorateWith('positiveComplementarity', 'encourageNationalProceedings');\n  }\n}\nclass DynamicComplementarity extends ProsecutorOffice {\n  void developComplementarity() {\n    return decorateWith('positiveComplementarity', 'encourageNationalProceedings', 'balancePartnershipVigilance');\n  }\n}",
    "technique": "Decorator Pattern (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Created a base ProsecutorOffice class for complementarity interpretations.",
      "Step 2: Defined a method emphasizing positive complementarity.",
      "Step 3: Extended with DynamicComplementarity to add balance of partnership and vigilance.",
      "Step 4: Used decoration to enhance the base complementarity with dynamic policy."
    ]
  },
  {
    "input": "While the ultimate outcome of an admissibility determination under Article 17 is binary, the underlying assessment process frequently involves gradational evaluations, conditional findings, and spectrum-based reasoning. This seemingly clear dichotomy often masks complex qualitative judgments about the nature, extent, and genuineness of state action or inaction.",
    "output": "Admissibility determination outcome binary. Assessment process involve gradational evaluations, conditional findings, spectrum reasoning. Dichotomy mask qualitative judgments state action, inaction.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped modifiers like 'ultimate' from 'ultimate outcome' to focus on 'outcome binary'.",
      "Step 2: Reduced 'frequently involves gradational evaluations, conditional findings, and spectrum-based reasoning' to 'involve gradational evaluations, conditional findings, spectrum reasoning'.",
      "Step 3: Simplified 'masks complex qualitative judgments about the nature, extent, and genuineness' to 'mask qualitative judgments state action, inaction'."
    ]
  },
  {
    "input": "The legal standards within Article 17 employ qualitative terms such as 'genuinely,' 'unjustified delay,' and 'substantial collapse or unavailability'. These terms inherently resist purely quantitative or checklist-based application, demanding interpretation and judgment about degrees of intent, effort, capacity, and impact.",
    "output": "fork {\n  task1: applyQualitativeTerms(genuinely, unjustifiedDelay);\n  task2: assessSubstantialCollapse(unavailability);\n}\njoin {\n  result: combine(task1, task2, requireInterpretationJudgment);\n}",
    "technique": "Fork-Join (Concurrency)",
    "application_steps": [
      "Step 1: Split assessment into two parallel tasks: qualitative terms and collapse/unavailability.",
      "Step 2: Assigned task1 to apply 'genuinely' and 'unjustified delay'.",
      "Step 3: Assigned task2 to assess 'substantial collapse' and 'unavailability'.",
      "Step 4: Joined results requiring interpretation and judgment."
    ]
  }
] [
  {
    "input": "Unwillingness, as defined in Article 17(2), considers whether national proceedings were undertaken to shield the person from ICC jurisdiction, or if there has been an unjustified delay inconsistent with an intent to bring the person to justice, or if proceedings were not conducted independently or impartially. This is described as a subjective criterion, pertaining to a State’s intentions, and is thus challenging to prove.",
    "output": "Article 17(2) defines Unwillingness: shielding proceedings, unjustified delays, or non-independent proceedings. Unwillingness is subjective, tied to State intent, hard to prove.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'unwillingness' as 'Unwillingness' to compress repetitive references.",
      "Step 2: Condensed 'considers whether national proceedings were undertaken to shield...' to 'shielding proceedings'.",
      "Step 3: Simplified 'unjustified delay inconsistent with an intent to bring...' to 'unjustified delays'.",
      "Step 4: Shortened 'described as a subjective criterion, pertaining to a State’s intentions, and is thus challenging' to 'subjective, tied to State intent, hard to prove'."
    ]
  },
  {
    "input": "Inability, as defined in Article 17(3), considers whether, due to a total or substantial collapse or unavailability of the national judicial system, the State cannot obtain the accused, necessary evidence and testimony, or otherwise carry out its proceedings. This criterion reflects an objective assessment of the State's factual capacity to handle the case.",
    "output": "Inability state cannot obtain accused, evidence, testimony, carry proceedings due collapse unavailability judicial system. Article 17(3) assess objective capacity.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'the' from 'the national judicial system'.",
      "Step 2: Omitted auxiliary verbs like 'is defined' in 'as defined in'.",
      "Step 3: Dropped prepositions like 'of' in 'unavailability of the'.",
      "Step 4: Eliminated conjunctions like 'and' in 'evidence and testimony'."
    ]
  },
  {
    "input": "The term 'genuinely' qualifies both 'unwilling' and 'unable' in Article 17(1)(a) and (b), signifying that the assessment goes beyond mere appearances and requires an evaluation of the bona fides of the national proceedings. A 'genuine' investigation or prosecution implies a real commitment by the state to bring perpetrators to justice.",
    "output": "Article 17(1)(a) and (b) use genuinely qualify unwilling, unable. Assessment evaluate bona fides national proceedings. Genuine investigation prosecution show state commitment justice.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Reduced 'signifying that the assessment goes beyond mere appearances and requires an evaluation' to 'Assessment evaluate'.",
      "Step 2: Simplified 'implies a real commitment by the state to bring perpetrators to justice' to 'show state commitment justice'."
    ]
  },
  {
    "input": "Beyond the admissibility criteria in Article 17, Article 53 provides the ICC Prosecutor with a distinct ground for potentially halting proceedings: the 'interests of justice'. Even if a situation falls within the Court's jurisdiction and a potential case appears admissible, the Prosecutor may decline to investigate or prosecute if doing so would not serve these interests.",
    "output": "pointcut execution(* haltProceedings(..)) {\n  checkInterestsOfJustice(article53);\n  allowProsecutorDecline(jurisdiction, admissibility);\n}",
    "technique": "Pointcut Definition (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Defined a pointcut for halting proceedings under Article 53.",
      "Step 2: Specified checking the 'interests of justice' criterion.",
      "Step 3: Included allowance for Prosecutor to decline based on jurisdiction and admissibility."
    ]
  },
  {
    "input": "A significant debate exists regarding whether the 'interests of justice' assessment can legitimately encompass broader considerations, particularly those related to peace and security. The OTP's 2007 policy paper acknowledged this debate and suggested a willingness to consider 'various national and international efforts to achieve peace and security' as a factor, while historically exercising caution in explicitly invoking Article 53 based on peace considerations.",
    "output": "Debate exists interests justice assessment include peace security. OTP 2007 paper acknowledge debate, consider peace security factor. OTP cautious invoke Article 53 peace considerations.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'A significant debate exists regarding...' into 'Debate exists interests justice assessment include peace security.'",
      "Step 2: Broke 'The OTP's 2007 policy paper acknowledged...' into 'OTP 2007 paper acknowledge debate, consider peace security factor.'",
      "Step 3: Divided 'while historically exercising caution in explicitly invoking...' into 'OTP cautious invoke Article 53 peace considerations.'"
    ]
  },
  {
    "input": "The ICC does not automatically deem a case inadmissible simply because a peace process is underway; rather, it scrutinizes the concrete impact of that process on the likelihood of genuine national accountability proceedings for the specific case before it. Early-stage negotiations or agreements with uncertain implementation prospects are unlikely to meet the Article 17 threshold for inadmissibility.",
    "output": "ICC not deem case inadmissible peace process underway. ICC scrutinize process impact genuine accountability proceedings case. Early negotiations, uncertain agreements not meet Article 17 threshold.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'ICC' as subject in 'ICC not deem' and 'ICC scrutinize'.",
      "Step 2: Restated 'process' explicitly in 'scrutinize process impact'.",
      "Step 3: Simplified 'Early-stage negotiations or agreements with uncertain implementation prospects' to 'Early negotiations, uncertain agreements'."
    ]
  },
  {
    "input": "Conversely, a well-established and functioning mechanism born from a peace process, demonstrably undertaking genuine proceedings relevant to potential ICC cases, can lead to a finding of inadmissibility. The closure of Colombia’s preliminary examination in 2021 reflected confidence in its Special Jurisdiction for Peace (JEP) and other national mechanisms as genuine national efforts.",
    "output": "Peace process mechanism undertake genuine proceedings lead inadmissibility. Colombia 2021 closure show confidence Special Jurisdiction Peace, national mechanisms genuine efforts.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'Conversely, a well-established and functioning' to simplify to 'Peace process mechanism'.",
      "Step 2: Condensed 'demonstrably undertaking genuine proceedings relevant to potential ICC cases' to 'undertake genuine proceedings'.",
      "Step 3: Simplified 'reflected confidence in its Special Jurisdiction for Peace (JEP) and other national mechanisms as genuine national efforts' to 'show confidence Special Jurisdiction Peace, national mechanisms genuine efforts'."
    ]
  },
  {
    "input": "While Article 17 focuses on the status and genuineness of national judicial proceedings, broader concerns about peace and stability often form an unavoidable backdrop to ICC interventions. Although stability is not an explicit legal criterion for admissibility, such factors can implicitly influence OTP strategic decision-making.",
    "output": "Article 17 focus judicial proceedings genuineness. Peace stability concerns backdrop ICC interventions. Stability not legal criterion, influence OTP decision-making.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'While Article 17 focuses on...' into 'Article 17 focus judicial proceedings genuineness.'",
      "Step 2: Broke 'broader concerns about peace and stability...' into 'Peace stability concerns backdrop ICC interventions.'",
      "Step 3: Divided 'Although stability is not an explicit legal criterion...' into 'Stability not legal criterion, influence OTP decision-making.'"
    ]
  },
  {
    "input": "The concept of 'positive complementarity' represents a shift from viewing complementarity primarily as a jurisdictional test to actively encouraging, supporting, and assisting national jurisdictions. This approach involves the ICC system working to enable states to fulfill their primary responsibility to investigate and prosecute Rome Statute crimes domestically.",
    "output": "class Complementarity {\n  void applyApproach() {\n    return decorateWith('jurisdictionalTest');\n  }\n}\nclass PositiveComplementarity extends Complementarity {\n  void applyApproach() {\n    return decorateWith('jurisdictionalTest', 'encourageSupportAssist');\n  }\n}",
    "technique": "Decorator Pattern (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Created a base Complementarity class for the jurisdictional test approach.",
      "Step 2: Defined a method applying the jurisdictional test.",
      "Step 3: Extended with PositiveComplementarity to add encouragement, support, and assistance.",
      "Step 4: Used decoration to enhance the base approach."
    ]
  },
  {
    "input": "The OTP's 2024 Policy on Complementarity and Cooperation formally consolidates this approach, framing the ICC not as an 'apex' court but as a 'hub' within a network of accountability efforts. The policy emphasizes partnership with states, civil society, and regional organizations, aiming to bring justice closer to affected communities.",
    "output": "OTP 2024 Policy consolidate complementarity cooperation. ICC hub accountability network, not apex court. Policy emphasize partnership states, civil society, regional organizations, bring justice communities.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'the' from 'The OTP's 2024 Policy'.",
      "Step 2: Omitted auxiliary verbs like 'formally consolidates' to 'consolidate'.",
      "Step 3: Dropped prepositions like 'within' in 'within a network'.",
      "Step 4: Eliminated conjunctions like 'and' in 'states, civil society, and regional organizations'."
    ]
  },
  {
    "input": "A significant challenge within the complementarity assessment is whether transitional justice mechanisms (TJMs) other than formal criminal prosecution, such as truth commissions or traditional justice rituals, can qualify as the type of national 'activity' that would render a case inadmissible under Article 17(1)(a) or (b). Scholarly opinion on this matter is divided, with some arguing for a narrow interpretation requiring criminal justice investigations.",
    "output": "Complementarity assessment challenge transitional justice mechanisms qualify national activity. Truth commissions, traditional rituals render case inadmissible Article 17(1)(a)(b). Scholarly opinion divided, some require criminal investigations.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Complementarity assessment' as subject in 'Complementarity assessment challenge'.",
      "Step 2: Restated 'transitional justice mechanisms' in 'transitional justice mechanisms qualify'.",
      "Step 3: Simplified 'Scholarly opinion on this matter is divided' to 'Scholarly opinion divided'."
    ]
  },
  {
    "input": "Blanket amnesties, particularly those granted by perpetrators to themselves or those that unconditionally absolve individuals of responsibility for genocide, crimes against humanity, or war crimes, are generally viewed as incompatible with the international legal obligation to combat impunity. Such measures could be interpreted as evidence of 'unwillingness' under Article 17.",
    "output": "Blanket amnesties incompatible combat impunity obligation. Perpetrators grant amnesties absolve genocide, crimes against humanity, war crimes show unwillingness Article 17.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'particularly those granted by perpetrators to themselves or those that unconditionally' to simplify to 'Blanket amnesties'.",
      "Step 2: Condensed 'generally viewed as incompatible with the international legal obligation to combat impunity' to 'incompatible combat impunity obligation'.",
      "Step 3: Simplified 'could be interpreted as evidence of 'unwillingness' under Article 17' to 'show unwillingness Article 17'."
    ]
  },
  {
    "input": "The ICC's approach in the Colombian situation suggests a significant degree of flexibility regarding sentencing outcomes within the complementarity assessment. It demonstrates a willingness to accept nationally-designed, context-specific justice solutions emerging from peace agreements, provided the underlying process meets the threshold of 'genuineness' in its intent and execution.",
    "output": "ICC approach Colombia show flexibility sentencing outcomes complementarity assessment. ICC accept national justice solutions peace agreements, process meet genuineness threshold.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'suggests a significant degree of flexibility' to 'show flexibility' to use an action verb.",
      "Step 2: Replaced 'demonstrates a willingness to accept nationally-designed, context-specific' with 'accept national'.",
      "Step 3: Converted 'provided the underlying process meets the threshold of 'genuineness' in its intent and execution' to 'process meet genuineness threshold'."
    ]
  },
  {
    "input": "UN Security Council (UNSC) referrals under Article 13(b) of the Rome Statute, made pursuant to Chapter VII of the UN Charter, represent a powerful trigger for ICC jurisdiction, allowing the Court to investigate situations in states that are not parties. This mechanism effectively bypasses the need for the referred state's consent and can preempt potential admissibility challenges, particularly when the government is clearly unwilling to prosecute.",
    "output": "fork {\n  task1: triggerJurisdiction(unscReferrals, article13b);\n  task2: bypassStateConsent(nonPartyStates);\n}\njoin {\n  result: combine(task1, task2, preemptAdmissibilityChallenges);\n}",
    "technique": "Fork-Join (Concurrency)",
    "application_steps": [
      "Step 1: Split the referral process into two parallel tasks: triggering jurisdiction and bypassing consent.",
      "Step 2: Assigned task1 to handle UNSC referrals under Article 13(b).",
      "Step 3: Assigned task2 to bypass state consent for non-party states.",
      "Step 4: Joined results to preempt admissibility challenges."
    ]
  },
  {
    "input": "The International Criminal Court (ICC) operates as a court of last resort, intervening only when national courts are unwilling or unable to prosecute serious crimes like genocide, war crimes, and crimes against humanity. This principle, known as complementarity, is outlined in Article 17 of the Rome Statute.",
    "output": "ICC operate last resort court intervene national courts unwilling unable prosecute genocide, war crimes, crimes against humanity. Complementarity Article 17 Rome Statute.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'The' from 'The International Criminal Court'.",
      "Step 2: Omitted auxiliary verbs like 'is' in 'is outlined'.",
      "Step 3: Dropped prepositions like 'as' in 'known as complementarity'.",
      "Step 4: Eliminated conjunctions like 'and' in 'unwilling or unable'."
    ]
  },
  {
    "input": "Article 17 of the Rome Statute operationalizes the complementarity principle, setting out the specific conditions under which a case may be deemed inadmissible before the ICC. The core of Article 17 lies in its deference to genuine national proceedings, prioritizing the primary right and responsibility of states to investigate and prosecute the most serious crimes of international concern.",
    "output": "Article 17 operationalize Complementarity, set conditions case inadmissible ICC. Article 17 defer genuine national proceedings, prioritize state right investigate prosecute serious crimes.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'complementarity principle' as 'Complementarity' to compress references.",
      "Step 2: Simplified 'operationalizes the complementarity principle, setting out' to 'operationalize Complementarity, set'.",
      "Step 3: Condensed 'deemed inadmissible before the ICC' to 'inadmissible ICC'.",
      "Step 4: Shortened 'prioritizing the primary right and responsibility of states to investigate and prosecute the most serious crimes of international concern' to 'prioritize state right investigate prosecute serious crimes'."
    ]
  },
  {
    "input": "A case is inadmissible if a state with jurisdiction is actively investigating or prosecuting it (Article 17(1)(a)), or if the state has investigated and decided not to prosecute (Article 17(1)(b)), or if the person has already been tried for the same conduct (Article 17(1)(c)). However, the ICC may still proceed if the state is found to be 'unwilling or unable genuinely' to carry out the investigation or prosecution. This 'unwilling or unable genuinely' test is the mechanism through which the ICC ensures that complementarity does not become a shield for impunity.",
    "output": "Case inadmissible state investigate prosecute, decide not prosecute, person tried same conduct. ICC proceed state unwilling unable investigate prosecute genuinely. Test ensure complementarity not shield impunity.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'if a state with jurisdiction is actively' to simplify to 'state investigate prosecute'.",
      "Step 2: Condensed 'or if the state has investigated and decided not to prosecute (Article 17(1)(b))' to 'decide not prosecute'.",
      "Step 3: Simplified 'However, the ICC may still proceed if the state is found to be 'unwilling or unable genuinely' to carry out' to 'ICC proceed state unwilling unable investigate prosecute genuinely'.",
      "Step 4: Shortened 'the mechanism through which the ICC ensures that complementarity does not become a shield for impunity' to 'Test ensure complementarity not shield impunity'."
    ]
  },
  {
    "input": "The very structure of the complementarity principle reflects an inherent tension, emerging as a compromise between delegations advocating for a court with strong jurisdiction to combat impunity and those prioritizing the protection of state sovereignty. This underlying tension inevitably shapes how the criteria for admissibility, particularly the assessment of 'unwillingness' and 'inability,' are interpreted and applied.",
    "output": "Complementarity structure reflect tension compromise strong jurisdiction combat impunity, prioritize sovereignty. Tension shape admissibility criteria unwillingness, inability interpretation application.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'reflects an inherent tension' to 'reflect tension' to use an action verb.",
      "Step 2: Replaced 'emerging as a compromise between delegations advocating for' with 'compromise strong jurisdiction'.",
      "Step 3: Converted 'shapes how the criteria for admissibility, particularly the assessment of 'unwillingness' and 'inability,' are interpreted and applied' to 'shape admissibility criteria unwillingness, inability interpretation application'."
    ]
  },
  {
    "input": "The ICC's mandate, as derived from the Rome Statute, is primarily focused on ending impunity for the perpetrators of the most serious crimes and contributing to the prevention of such crimes. The ICC primarily delivers retributive justice focused on individual criminal responsibility and punishment, which differs substantially from other transitional justice mechanisms.",
    "output": "ICC mandate Rome Statute end impunity serious crimes, prevent crimes. ICC deliver retributive justice individual responsibility punishment, differ transitional justice mechanisms.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'as derived from' to focus on 'ICC mandate Rome Statute'.",
      "Step 2: Reduced 'primarily focused on ending impunity for the perpetrators of the most serious crimes and contributing to the prevention' to 'end impunity serious crimes, prevent crimes'.",
      "Step 3: Simplified 'delivers retributive justice focused on individual criminal responsibility and punishment, which differs substantially from' to 'deliver retributive justice individual responsibility punishment, differ'."
    ]
  },
  {
    "input": "ICC jurisprudence has established that for national proceedings to preclude ICC admissibility, the state must demonstrate 'tangible, concrete and progressive' investigative or prosecutorial steps regarding the specific case. The 'case' is defined by the specific individual and substantially the same conduct alleged in the ICC proceedings.",
    "output": "pipeline {\n  stage1: demonstrateTangibleSteps(nationalProceedings);\n  stage2: verifyCaseDefinition(specificIndividual, sameConduct);\n}",
    "technique": "Pipeline (Concurrency)",
    "application_steps": [
      "Step 1: Created a pipeline with two stages for admissibility assessment.",
      "Step 2: Stage1 requires demonstrating tangible, concrete steps.",
      "Step 3: Stage2 verifies the case definition based on individual and conduct."
    ]
  }
] [
  {
    "input": "The embedding of 'genuinely' in Article 17’s text is central to ICC analyses, acting as a linguistic marker of a high threshold. A 'genuine' investigation or prosecution implies a real commitment by the state to bring perpetrators to justice, conducted in a manner consistent with international standards of due process and impartiality. National proceedings must demonstrate 'tangible, concrete and progressive' investigative or prosecutorial steps regarding the specific case to preclude ICC admissibility.",
    "output": "Article 17 embed Genuineness, mark high threshold. Genuine investigation prosecution show state commitment justice, meet due process, impartiality standards. National proceedings demonstrate tangible steps preclude ICC admissibility.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'genuinely' as 'Genuineness' to compress references.",
      "Step 2: Simplified 'embedding of 'genuinely' in Article 17’s text is central to ICC analyses' to 'Article 17 embed Genuineness'.",
      "Step 3: Condensed 'implies a real commitment by the state to bring perpetrators to justice, conducted in a manner consistent with international standards' to 'show state commitment justice, meet due process, impartiality standards'.",
      "Step 4: Shortened 'demonstrate 'tangible, concrete and progressive' investigative or prosecutorial steps' to 'demonstrate tangible steps'."
    ]
  },
  {
    "input": "The ICC requires concrete evidence of national action, stating that 'mere preparedness to take such steps or the investigation of other suspects is not sufficient' to consider a case being investigated by a State. Only actual investigative acts targeting the same suspects count, such as interviewing witnesses or suspects, collecting documentary evidence, or carrying out forensic analyses. If such concrete steps are absent with respect to the same suspects, 'it cannot be said that the same case is... under investigation' by the national jurisdiction.",
    "output": "ICC require evidence national action. Preparedness, other suspects investigation not sufficient. Actual acts target same suspects count, interview witnesses, collect evidence, forensic analyses. No concrete steps same suspects, case not investigated.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'The ICC requires concrete evidence...' into 'ICC require evidence national action.'",
      "Step 2: Broke 'stating that 'mere preparedness to take such steps...' into 'Preparedness, other suspects investigation not sufficient.'",
      "Step 3: Divided 'Only actual investigative acts targeting...' into 'Actual acts target same suspects count, interview witnesses, collect evidence, forensic analyses.'",
      "Step 4: Separated 'If such concrete steps are absent...' into 'No concrete steps same suspects, case not investigated.'"
    ]
  },
  {
    "input": "UN Security Council (UNSC) referrals under Article 13(b) of the Rome Statute, made pursuant to Chapter VII of the UN Charter, represent a powerful trigger for ICC jurisdiction. Such referrals allow the Court to investigate situations in states not parties to the Rome Statute, bypassing state consent and effectively preempting potential admissibility challenges based on an unwilling government. The ICC Pre-Trial Chamber found that Article 27 of the Rome Statute, which states official capacity is irrelevant, applied to individuals like Omar Al Bashir, meaning he enjoyed no immunity before the ICC itself despite his status as a sitting head of state.",
    "output": "UNSC referrals Article 13(b) trigger ICC jurisdiction. Referrals investigate non-party states, bypass consent, preempt admissibility challenges unwilling government. Article 27 apply Omar Al Bashir, no immunity ICC, despite head state status.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'made pursuant to Chapter VII of the UN Charter' to simplify to 'Article 13(b) trigger'.",
      "Step 2: Condensed 'allow the Court to investigate situations in states not parties to the Rome Statute' to 'investigate non-party states'.",
      "Step 3: Simplified 'effectively preempting potential admissibility challenges based on an unwilling government' to 'preempt admissibility challenges unwilling government'.",
      "Step 4: Shortened 'found that Article 27... applied to individuals like Omar Al Bashir, meaning he enjoyed no immunity' to 'Article 27 apply Omar Al Bashir, no immunity'."
    ]
  },
  {
    "input": "Article 16 of the Rome Statute provides the most direct legal mechanism for the UNSC to intervene in ICC proceedings based on peace and security concerns. Acting under Chapter VII of the UN Charter, the Council can adopt a resolution requesting the ICC not to commence or proceed with an investigation or prosecution for a period of 12 months. This request can be renewed under the same conditions, representing a latent power acknowledging the potential conflict between pursuing international justice and maintaining international peace and security.",
    "output": "pointcut execution(* interveneICCProceedings(..)) {\n  checkArticle16(unscResolution);\n  requestPauseInvestigation(12Months);\n  allowRenewal(sameConditions);\n}",
    "technique": "Pointcut Definition (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Defined a pointcut for UNSC intervention in ICC proceedings.",
      "Step 2: Specified checking Article 16 for UNSC resolution.",
      "Step 3: Included request to pause investigation for 12 months.",
      "Step 4: Added allowance for renewal under same conditions."
    ]
  },
  {
    "input": "'Inactivity' is a term of art in ICC practice meaning that no relevant domestic investigation or prosecution is ongoing or has been conducted against the person for the conduct in question. If no concrete investigative or prosecutorial steps are found, the national jurisdiction is considered inactive, and the admissibility inquiry effectively ends. Any failure by a State to investigate at all, for whatever reason, triggers ICC admissibility.",
    "output": "Inactivity mean no domestic investigation prosecution person conduct. No concrete steps, jurisdiction inactive, admissibility inquiry end. State failure investigate trigger ICC admissibility.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'is a term of art in ICC practice meaning that' to focus on 'Inactivity mean'.",
      "Step 2: Reduced 'no relevant domestic investigation or prosecution is ongoing or has been conducted' to 'no domestic investigation prosecution'.",
      "Step 3: Simplified 'Any failure by a State to investigate at all, for whatever reason, triggers' to 'State failure investigate trigger'."
    ]
  },
  {
    "input": "The ICC primarily delivers retributive justice focused on individual criminal responsibility and punishment. This model differs substantially from other transitional justice mechanisms (TJMs) such as truth commissions, reparations programs, institutional reforms, or traditional/restorative justice practices. These alternative mechanisms may prioritize reconciliation, truth-telling, social repair, or collective healing over individual punishment.",
    "output": "ICC deliver retributive justice individual responsibility punishment. ICC differ truth commissions, reparations, reforms, restorative practices. Alternative mechanisms prioritize reconciliation, truth-telling, social repair, collective healing.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'The ICC primarily delivers...' into 'ICC deliver retributive justice individual responsibility punishment.'",
      "Step 2: Broke 'This model differs substantially...' into 'ICC differ truth commissions, reparations, reforms, restorative practices.'",
      "Step 3: Divided 'These alternative mechanisms may prioritize...' into 'Alternative mechanisms prioritize reconciliation, truth-telling, social repair, collective healing.'"
    ]
  },
  {
    "input": "A general consensus has emerged in scholarship and practice that blanket amnesties, particularly those granted by perpetrators to themselves or those that unconditionally absolve individuals of responsibility for genocide, crimes against humanity, or war crimes, are incompatible with the international legal obligation to combat impunity. Such measures are often viewed as directly contradicting the Preamble's affirmation of the duty to prosecute international crimes. In the context of Article 17, a state's decision to grant a blanket amnesty could be interpreted as evidence of 'unwillingness'.",
    "output": "Blanket amnesties incompatible combat impunity obligation. Perpetrators grant amnesties absolve genocide, crimes against humanity, war crimes contradict Preamble duty prosecute. Article 17 interpret amnesty unwillingness.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'A general consensus has emerged in scholarship and practice that' to simplify to 'Blanket amnesties incompatible'.",
      "Step 2: Condensed 'particularly those granted by perpetrators to themselves or those that unconditionally absolve individuals of responsibility' to 'Perpetrators grant amnesties absolve'.",
      "Step 3: Simplified 'are often viewed as directly contradicting the Preamble's affirmation of the duty to prosecute international crimes' to 'contradict Preamble duty prosecute'.",
      "Step 4: Shortened 'a state's decision to grant a blanket amnesty could be interpreted as evidence of 'unwillingness'' to 'Article 17 interpret amnesty unwillingness'."
    ]
  },
  {
    "input": "The status of conditional amnesties, which are amnesties granted in exchange for specific actions like full participation in a truth commission or disarmament, is more contested. The Rome Statute itself is silent on the permissibility of amnesties and pardons for crimes within the Court's jurisdiction, reflecting a lack of consensus among states during the drafting process. The ICC has not issued a definitive ruling on the compatibility of conditional amnesties with Article 17 requirements, creating significant legal uncertainty.",
    "output": "Conditional amnesties contested. Rome Statute silent amnesties, pardons jurisdiction crimes. ICC not rule conditional amnesties Article 17 compatibility, create legal uncertainty.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'the' from 'The status of conditional amnesties'.",
      "Step 2: Omitted auxiliary verbs like 'is' in 'is more contested'.",
      "Step 3: Dropped prepositions like 'on' in 'on the permissibility'.",
      "Step 4: Eliminated conjunctions like 'and' in 'amnesties and pardons'."
    ]
  },
  {
    "input": "The ICC's approach in the Colombian situation suggests a significant degree of flexibility regarding sentencing outcomes within the complementarity assessment. It indicates a willingness to accept nationally-designed, context-specific justice solutions emerging from peace agreements, provided the underlying process meets the threshold of 'genuineness' in its intent and execution. For example, the OTP deemed Colombia's Special Jurisdiction for Peace (JEP) process genuine, even with its differentiated and often restorative sanctions, leading to the closure of the preliminary examination.",
    "output": "ICC approach Colombia show flexibility sentencing complementarity assessment. ICC accept national justice solutions peace agreements, process meet genuineness threshold. OTP deem Colombia JEP process genuine, restorative sanctions, close examination.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'suggests a significant degree of flexibility' to 'show flexibility' to use an action verb.",
      "Step 2: Replaced 'indicates a willingness to accept nationally-designed, context-specific' with 'accept national'.",
      "Step 3: Converted 'provided the underlying process meets the threshold of 'genuineness' in its intent and execution' to 'process meet genuineness threshold'.",
      "Step 4: Simplified 'deemed Colombia's Special Jurisdiction for Peace (JEP) process genuine, even with its differentiated and often restorative sanctions, leading to the closure' to 'deem Colombia JEP process genuine, restorative sanctions, close examination'."
    ]
  },
  {
    "input": "The concept of 'positive complementarity' represents a shift from viewing complementarity primarily as a jurisdictional test to actively encouraging, supporting, and assisting national jurisdictions. This approach involves the ICC system working to enable states to fulfill their primary responsibility to investigate and prosecute Rome Statute crimes domestically. The OTP's 2024 Policy on Complementarity and Cooperation formally consolidates this approach, framing the ICC as a 'hub' within a network of accountability efforts.",
    "output": "Positive complementarity shift jurisdictional test encourage support assist national jurisdictions. ICC enable states investigate prosecute Rome Statute crimes. OTP 2024 Policy consolidate approach, frame ICC hub accountability network.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'The concept of 'positive complementarity' represents' to focus on 'Positive complementarity shift'.",
      "Step 2: Reduced 'actively encouraging, supporting, and assisting national jurisdictions' to 'encourage support assist national jurisdictions'.",
      "Step 3: Simplified 'formally consolidates this approach, framing the ICC as a 'hub' within a network of accountability efforts' to 'consolidate approach, frame ICC hub accountability network'."
    ]
  },
  {
    "input": "The stage of development and the degree of certainty surrounding peace process-related justice mechanisms are critical factors in the ICC's complementarity assessment. Early-stage negotiations or agreements with uncertain implementation prospects are unlikely to meet the Article 17 threshold for inadmissibility, as seen in the Uganda situation concerning the Juba Peace Talks. Conversely, a well-established and functioning mechanism born from a peace process, demonstrably undertaking genuine proceedings, can lead to a finding of inadmissibility, as in Colombia.",
    "output": "Peace process justice mechanisms development, certainty critical ICC complementarity assessment. Early negotiations, uncertain agreements not meet Article 17 threshold, Uganda Juba Talks. Established mechanism genuine proceedings lead inadmissibility, Colombia.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Peace process justice mechanisms' as subject in 'Peace process justice mechanisms development'.",
      "Step 2: Restated 'Early negotiations' in 'Early negotiations, uncertain agreements not meet'.",
      "Step 3: Repeated 'Established mechanism' in 'Established mechanism genuine proceedings'."
    ]
  },
  {
    "input": "The International Criminal Court (ICC) applies the complementarity principle consistently across regions, with no clear evidence of regional or cultural bias in admissibility decisions. While academic discourse notes a perception of bias against Africa due to the concentration of cases, many scholars argue this stems from situational factors, not discriminatory application of complementarity. Outcomes vary due to specific circumstances, such as the strength of national justice systems and the prevalence of self-referrals or Security Council referrals, rather than regional differences.",
    "output": "class ComplementarityApplication {\n  void applyPrinciple() {\n    return decorateWith('consistentAcrossRegions');\n  }\n}\nclass AdmissibilityDecisions extends ComplementarityApplication {\n  void applyPrinciple() {\n    return decorateWith('consistentAcrossRegions', 'noRegionalBias', 'situationalFactors');\n  }\n}",
    "technique": "Decorator Pattern (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Created a base ComplementarityApplication class for principle application.",
      "Step 2: Defined a method applying complementarity consistently across regions.",
      "Step 3: Extended with AdmissibilityDecisions to add no regional bias and situational factors.",
      "Step 4: Used decoration to enhance the base application."
    ]
  },
  {
    "input": "The Rome Statute’s six official languages—Arabic, Chinese, English, French, Russian, and Spanish—are equally authentic and all versions convey the same complementarity standards. Terms like 'unwilling or unable genuinely' are consistently translated, with 'genuinely' rendered as 'véritablement' (French), 'realmente' (Spanish), 'действительно' (Russian), '真正' (Chinese), and 'حقيقةً' (Arabic). This linguistic unity across languages reinforces the uniformity of complementarity principles and has helped the Court's jurisprudence avoid divergent interpretations.",
    "output": "Rome Statute languages authentic, convey complementarity standards. Terms unwilling unable genuinely translated véritablement, realmente, действительно, 真正, حقيقةً. Linguistic unity reinforce uniformity, avoid divergent interpretations.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'six official languages—Arabic, Chinese, English, French, Russian, and Spanish—are equally' to simplify to 'Rome Statute languages authentic'.",
      "Step 2: Condensed 'all versions convey the same complementarity standards' to 'convey complementarity standards'.",
      "Step 3: Simplified 'This linguistic unity across languages reinforces the uniformity of complementarity principles and has helped the Court's jurisprudence avoid divergent interpretations' to 'Linguistic unity reinforce uniformity, avoid divergent interpretations'."
    ]
  },
  {
    "input": "The ICC's strict linguistic approach tends to favor admissibility, leading to ICC intervention, in cases of doubt regarding national proceedings. If a State’s showing of genuine national action is marginal or insufficient, the ICC has thus far leaned toward finding the case admissible. This stringent application of terms like 'same suspects' and 'concrete steps' ensures that general reforms or partial activity do not avert ICC admissibility if specific, genuine investigations are lacking.",
    "output": "ICC linguistic approach favor admissibility, lead intervention doubtful national proceedings. State show marginal genuine action, ICC find case admissible. Stringent terms same suspects, concrete steps ensure reforms, partial activity not avert admissibility.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'The ICC's strict linguistic approach...' into 'ICC linguistic approach favor admissibility, lead intervention doubtful national proceedings.'",
      "Step 2: Broke 'If a State’s showing of genuine national action...' into 'State show marginal genuine action, ICC find case admissible.'",
      "Step 3: Divided 'This stringent application of terms...' into 'Stringent terms same suspects, concrete steps ensure reforms, partial activity not avert admissibility.'"
    ]
  },
  {
    "input": "The International Criminal Court (ICC) operates as a court of last resort, intervening only when national courts are unwilling or unable to prosecute serious crimes like genocide, war crimes, and crimes against humanity. This principle, known as complementarity, is outlined in Article 17 of the Rome Statute.",
    "output": "ICC last resort court, intervene national courts unwilling unable prosecute genocide, war crimes, crimes against humanity. Complementarity Article 17 Rome Statute.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'The International Criminal Court (ICC) operates as' to focus on 'ICC last resort court'.",
      "Step 2: Reduced 'intervening only when national courts are unwilling or unable to prosecute serious crimes like' to 'intervene national courts unwilling unable prosecute'.",
      "Step 3: Simplified 'This principle, known as complementarity, is outlined in Article 17 of the Rome Statute' to 'Complementarity Article 17 Rome Statute'."
    ]
  },
  {
    "input": "Article 17 of the Rome Statute operationalizes the complementarity principle, setting out the specific conditions under which a case may be deemed inadmissible before the ICC. The core of Article 17 lies in its deference to genuine national proceedings, prioritizing the primary right and responsibility of states to investigate and prosecute the most serious crimes of international concern.",
    "output": "Article 17 operationalize Complementarity, set conditions case inadmissible ICC. Article 17 defer genuine proceedings, prioritize state responsibility investigate prosecute serious crimes.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'operationalizes' to 'operationalize' to use an action verb.",
      "Step 2: Replaced 'setting out the specific conditions under which a case may be deemed' with 'set conditions case inadmissible'.",
      "Step 3: Converted 'lies in its deference to genuine national proceedings, prioritizing the primary right and responsibility of states' to 'defer genuine proceedings, prioritize state responsibility'."
    ]
  },
  {
    "input": "A case is inadmissible if a state with jurisdiction is actively investigating or prosecuting it (Article 17(1)(a)), or if the state has investigated and decided not to prosecute (Article 17(1)(b)), or if the person has already been tried for the same conduct (Article 17(1)(c)). However, the ICC may still proceed if the state is found to be 'unwilling or unable genuinely' to carry out the investigation or prosecution. This 'unwilling or unable genuinely' test is the mechanism through which the ICC ensures that complementarity does not become a shield for impunity.",
    "output": "fork {\n  task1: checkStateInvestigation(article17_1_a_b);\n  task2: verifyPriorTrial(sameConduct, article17_1_c);\n}\njoin {\n  result: combine(task1, task2, applyUnwillingUnableTest);\n}",
    "technique": "Fork-Join (Concurrency)",
    "application_steps": [
      "Step 1: Split admissibility check into two parallel tasks: state investigation and prior trial.",
      "Step 2: Assigned task1 to verify state investigation or decision not to prosecute.",
      "Step 3: Assigned task2 to verify prior trial for same conduct.",
      "Step 4: Joined results with the unwilling/unable test application."
    ]
  },
  {
    "input": "The very structure of the complementarity principle reflects an inherent tension, emerging as a compromise between delegations advocating for a court with strong jurisdiction to combat impunity and those prioritizing the protection of state sovereignty. This underlying tension inevitably shapes how the criteria for admissibility, particularly the assessment of 'unwillingness' and 'inability,' are interpreted and applied.",
    "output": "Complementarity structure show tension compromise jurisdiction combat impunity, prioritize sovereignty. Tension shape admissibility criteria unwillingness, inability application.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'The very structure of the complementarity principle reflects' to focus on 'Complementarity structure show'.",
      "Step 2: Reduced 'emerging as a compromise between delegations advocating for a court with strong jurisdiction to combat impunity and those prioritizing the protection of state sovereignty' to 'compromise jurisdiction combat impunity, prioritize sovereignty'.",
      "Step 3: Simplified 'inevitably shapes how the criteria for admissibility, particularly the assessment of 'unwillingness' and 'inability,' are interpreted and applied' to 'shape admissibility criteria unwillingness, inability application'."
    ]
  },
  {
    "input": "The ICC's mandate, as derived from the Rome Statute, is primarily focused on ending impunity for the perpetrators of the most serious crimes and contributing to the prevention of such crimes. The ICC primarily delivers retributive justice focused on individual criminal responsibility and punishment, which differs substantially from other transitional justice mechanisms.",
    "output": "ICC mandate Rome Statute end impunity serious crimes, prevent crimes. ICC deliver retributive justice individual responsibility, differ transitional justice mechanisms.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'as derived from' to simplify to 'ICC mandate Rome Statute'.",
      "Step 2: Condensed 'primarily focused on ending impunity for the perpetrators of the most serious crimes and contributing to the prevention of such crimes' to 'end impunity serious crimes, prevent crimes'.",
      "Step 3: Simplified 'delivers retributive justice focused on individual criminal responsibility and punishment, which differs substantially from' to 'deliver retributive justice individual responsibility, differ'."
    ]
  },
  {
    "input": "ICC jurisprudence has established that for national proceedings to preclude ICC admissibility, the state must demonstrate 'tangible, concrete and progressive' investigative or prosecutorial steps regarding the specific case. The 'case' is defined by the specific individual and substantially the same conduct alleged in the ICC proceedings.",
    "output": "pipeline {\n  stage1: demonstrateTangibleSteps(nationalProceedings);\n  stage2: verifyCaseDefinition(specificIndividual, sameConduct);\n}",
    "technique": "Pipeline (Concurrency)",
    "application_steps": [
      "Step 1: Created a pipeline with two stages for admissibility assessment.",
      "Step 2: Stage1 requires demonstrating tangible, concrete steps.",
      "Step 3: Stage2 verifies the case definition based on individual and conduct."
    ]
  }
] [
  {
    "input": "Article 17(1)(a) and (b) stipulate that a case being investigated or prosecuted by a state, or previously investigated and declined, renders the ICC case inadmissible unless the state is 'unwilling or unable genuinely' to carry out the proceedings. The adverb 'genuinely' modifies the state's action and requires the ICC to evaluate the substance and integrity of national proceedings.",
    "output": "Article 17(1)(a) and (b) state that a case investigated or prosecuted by a state, or previously investigated and not prosecuted, makes the ICC case inadmissible unless the state lacks genuine willingness or ability to proceed. 'Genuinely' requires ICC evaluation of national proceedings' substance and integrity.",
    "technique": "Active Voice Conversion (Legal)",
    "application_steps": [
      "Step 1: Changed 'stipulate' to 'state' for active clarity.",
      "Step 2: Converted passive 'renders the ICC case inadmissible' to active 'makes the ICC case inadmissible'.",
      "Step 3: Reworded 'unwilling or unable genuinely to carry out' to 'lacks genuine willingness or ability to proceed'.",
      "Step 4: Simplified 'modifies the state's action and requires the ICC to evaluate' to 'requires ICC evaluation'."
    ]
  },
  {
    "input": "The standard for genuineness is not one of perfection, and proceedings are not automatically deemed 'non-genuine' due to resource limitations or failure to meet every conceivable human rights standard. However, they must possess a basic level of objective quality and not be a mere sham or so inadequate as to lack authenticity.",
    "output": "Standard genuineness not perfection. Proceedings not non-genuine resource limitations, human rights failure. Proceedings possess objective quality, not sham, not inadequate.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'the' from 'The standard for genuineness'.",
      "Step 2: Omitted auxiliary verbs like 'are' in 'are not automatically deemed'.",
      "Step 3: Dropped prepositions like 'due to' in 'due to resource limitations'.",
      "Step 4: Eliminated conjunctions like 'and' in 'and not be a mere sham'."
    ]
  },
  {
    "input": "Article 17(2) provides non-exhaustive indicators of unwillingness, including situations where proceedings were undertaken to shield the person concerned from criminal responsibility. Further indicators include unjustified delay inconsistent with an intent to bring the person to justice, or proceedings not conducted independently or impartially and inconsistent with such intent.",
    "output": "Article 17(2) lists indicators of unwillingness: shielding proceedings, unjustified delays, or non-independent proceedings. These show a lack of intent to achieve justice.",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Removed 'provides non-exhaustive' to simplify to 'lists'.",
      "Step 2: Consolidated 'situations where proceedings were undertaken to shield the person concerned from criminal responsibility' to 'shielding proceedings'.",
      "Step 3: Simplified 'inconsistent with an intent to bring the person to justice' to 'lack of intent to achieve justice'.",
      "Step 4: Condensed 'proceedings not conducted independently or impartially and inconsistent with such intent' to 'non-independent proceedings'."
    ]
  },
  {
    "input": "A state is deemed unable genuinely to carry out proceedings if, 'due to a total or substantial collapse or unavailability of its national judicial system, the State is unable to obtain the accused or the necessary evidence and testimony or otherwise unable to carry out its proceedings'. The inclusion of 'substantial' collapse explicitly signals that a complete breakdown of the judicial apparatus is not required.",
    "output": "State unable carry proceedings if Judicial Collapse prevents obtaining accused, evidence, testimony. Judicial Collapse includes total, substantial collapse, unavailability. Substantial collapse means complete breakdown not required.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'total or substantial collapse or unavailability of its national judicial system' as 'Judicial Collapse'.",
      "Step 2: Replaced 'due to a total or substantial collapse or unavailability' with 'Judicial Collapse prevents'.",
      "Step 3: Condensed 'unable to obtain the accused or the necessary evidence and testimony or otherwise unable' to 'prevents obtaining accused, evidence, testimony'.",
      "Step 4: Simplified 'inclusion of 'substantial' collapse explicitly signals' to 'Substantial collapse means'."
    ]
  },
  {
    "input": "ICC jurisprudence has consistently established a two-part test for determining the 'same case': national proceedings must involve the same individual and address 'substantially the same conduct' as alleged in the ICC proceedings. The burden rests on the party challenging admissibility to provide 'evidence of a sufficient degree of specificity and probative value'.",
    "output": "fork {\n  task1: checkSameIndividual(nationalProceedings, iccProceedings);\n  task2: checkSubstantiallySameConduct(nationalProceedings, iccAllegations);\n}\njoin {\n  result: combine(task1, task2, requireSpecificEvidence);\n}",
    "technique": "Fork-Join (Concurrency)",
    "application_steps": [
      "Step 1: Split the two-part test into parallel tasks: checking same individual and same conduct.",
      "Step 2: Assigned task1 to verify the same individual in national and ICC proceedings.",
      "Step 3: Assigned task2 to verify substantially same conduct.",
      "Step 4: Joined results with requirement for specific evidence."
    ]
  },
  {
    "input": "The Appeals Chamber clarified that the phrase 'is being investigated' requires tangible actions aimed at ascertaining criminal responsibility, such as 'interviewing witnesses or suspects, collecting documentary evidence, or carrying out forensic analyses'. General statements about ongoing national processes or promises to provide future updates were deemed insufficient.",
    "output": "Appeals Chamber clarify phrase investigated require tangible actions. Actions include interview witnesses, collect evidence, perform forensic analyses. General statements, future promises insufficient.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular verb form 'clarify' to 'clarified'.",
      "Step 2: Generalized 'requires tangible actions aimed at ascertaining criminal responsibility' to 'require tangible actions'.",
      "Step 3: Simplified 'were deemed insufficient' to 'insufficient'."
    ]
  },
  {
    "input": "The Appeals Chamber has repeatedly stated that admissibility is determined based on the factual situation 'at the time of the proceedings concerning the admissibility challenge'. This situation is 'not necessarily static, but ambulatory,' acknowledging that factors influencing admissibility can change over time.",
    "output": "Admissibility determined factual situation time proceedings. Situation ambulatory, not static. Factors change over time.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'The Appeals Chamber has repeatedly stated that' to focus on 'Admissibility determined'.",
      "Step 2: Reduced 'based on the factual situation at the time of the proceedings concerning the admissibility challenge' to 'factual situation time proceedings'.",
      "Step 3: Simplified 'acknowledging that factors influencing admissibility can change over time' to 'Factors change over time'."
    ]
  },
  {
    "input": "Article 18(3) mandates that the Prosecutor's deferral is open to review six months after the deferral date, or at any time if there is a 'significant change of circumstances based on the State's unwillingness or inability genuinely to carry out the investigation'. This review mechanism underscores the conditionality of the deferral.",
    "output": "Article 18(3) mandates Prosecutor review deferral six months later. Review possible anytime significant change State unwillingness inability investigate genuinely. Review mechanism show deferral conditional.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'Article 18(3) mandates that the Prosecutor's deferral...' into 'Article 18(3) mandates Prosecutor review deferral six months later.'",
      "Step 2: Broke 'or at any time if there is a significant change...' into 'Review possible anytime significant change State unwillingness inability investigate genuinely.'",
      "Step 3: Divided 'This review mechanism underscores...' into 'Review mechanism show deferral conditional.'"
    ]
  },
  {
    "input": "Article 17(1)(d) mandates that a case is inadmissible if it is 'not of sufficient gravity to justify further action by the Court,' ensuring the ICC focuses its limited resources on the 'most serious crimes of concern to the international community as a whole'. The assessment of gravity typically involves evaluating both quantitative and qualitative factors, including the scale and nature of the crimes.",
    "output": "pipeline {\n  stage1: checkCaseGravity(article17_1_d);\n  stage2: evaluateQuantitativeFactors(scale);\n  stage3: evaluateQualitativeFactors(nature);\n}",
    "technique": "Pipeline (Concurrency)",
    "application_steps": [
      "Step 1: Created a pipeline with three stages for gravity assessment.",
      "Step 2: Stage1 checks case gravity per Article 17(1)(d).",
      "Step 3: Stage2 evaluates quantitative factors like scale.",
      "Step 4: Stage3 evaluates qualitative factors like nature."
    ]
  },
  {
    "input": "The ICC is not barred from trying someone already tried in another court if those national proceedings were for the purpose of shielding the person from international criminal responsibility. Alternatively, the ICC may proceed if national proceedings 'were not conducted independently or impartially in accordance with due process norms recognized by international law and were conducted in a manner which, in the circumstances, was inconsistent with an intent to bring the person concerned to justice'.",
    "output": "ICC try person tried national court if shielding purpose. ICC proceed if national proceedings lack independence, due process, intent justice.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'is not barred from trying' to 'try' for conciseness.",
      "Step 2: Simplified 'were for the purpose of shielding the person from international criminal responsibility' to 'shielding purpose'.",
      "Step 3: Condensed 'were not conducted independently or impartially in accordance with due process norms recognized by international law and were conducted in a manner which, in the circumstances, was inconsistent with an intent' to 'lack independence, due process, intent justice'."
    ]
  },
  {
    "input": "In early admissibility decisions, the Court's language frequently emphasized the primacy of state proceedings, adopting a more deferential tone when discussing its relationship with national jurisdictions. This approach reflected the institutional need to assuage sovereignty concerns while establishing the Court's legitimacy.",
    "output": "Court emphasized state proceedings primacy early decisions. Court adopted deferential tone national jurisdictions. Approach assuaged sovereignty concerns, established legitimacy.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Court' as subject in 'Court emphasized' and 'Court adopted'.",
      "Step 2: Restated 'state proceedings' explicitly in 'Court emphasized state proceedings primacy'.",
      "Step 3: Simplified 'reflected the institutional need to assuage sovereignty concerns while establishing the Court's legitimacy' to 'Approach assuaged sovereignty concerns, established legitimacy'."
    ]
  },
  {
    "input": "The Appeals Chamber's judgment on Kenya's admissibility challenge illustrates a more assertive institutional voice, stating that admissibility must be determined 'on the basis of the facts as they exist at the time of the proceedings concerning the admissibility challenge'. This declarative language demonstrates a Court increasingly comfortable with making definitive pronouncements without excessive deference to state interpretations.",
    "output": "Appeals Chamber judgment Kenya challenge show assertive voice. Admissibility determined facts time proceedings. Declarative language show Court comfortable definitive pronouncements.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'illustrates a more assertive institutional voice' to 'show assertive voice'.",
      "Step 2: Reduced 'stating that admissibility must be determined on the basis of the facts as they exist at the time of the proceedings' to 'Admissibility determined facts time proceedings'.",
      "Step 3: Simplified 'demonstrates a Court increasingly comfortable with making definitive pronouncements without excessive deference' to 'show Court comfortable definitive pronouncements'."
    ]
  },
  {
    "input": "For the principle of complementarity and the entire Rome Statute system to function effectively, States Parties must translate their treaty obligations into domestic law through national implementation legislation. Article 88 specifically mandates that States Parties 'shall ensure that there are procedures available under their national law for all of the forms of cooperation' specified under Part 9 of the Statute.",
    "output": "States Parties translate treaty obligations domestic law. States Parties ensure cooperation procedures national law per Article 88, Part 9 Statute.",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Removed 'For the principle of complementarity and the entire Rome Statute system to function effectively' as redundant context.",
      "Step 2: Simplified 'must translate their treaty obligations into domestic law through national implementation legislation' to 'translate treaty obligations domestic law'.",
      "Step 3: Condensed 'shall ensure that there are procedures available under their national law for all of the forms of cooperation' to 'ensure cooperation procedures national law'."
    ]
  },
  {
    "input": "States Parties have adopted various methods to incorporate core crimes into national law, including Direct Incorporation/Replication, where definitions from the Rome Statute are closely replicated. Another common method, particularly in civil law traditions, involves Amendment of Existing Penal Codes, integrating the Rome Statute crimes into the existing national criminal code structure.",
    "output": "States Parties incorporate core crimes national law. States Parties use Direct Incorporation, replicate Rome Statute definitions. States Parties amend Penal Codes, integrate crimes civil law traditions.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'States Parties' as subject in all sentences for clarity.",
      "Step 2: Restated 'adopted various methods to incorporate' as 'incorporate core crimes national law'.",
      "Step 3: Split and repeated 'States Parties' in 'use Direct Incorporation' and 'amend Penal Codes'."
    ]
  },
  {
    "input": "While the International Criminal Court (ICC) has never explicitly adopted a formal 'margin of appreciation' doctrine akin to the European Court of Human Rights (ECtHR), varying degrees of deference to national proceedings are evident in the Court's Article 17 decisions. This jurisprudential evolution demonstrates a consistent tension between respecting state sovereignty and the imperative of ensuring genuine proceedings for international crimes.",
    "output": "ICC not adopt margin appreciation doctrine like ECtHR. ICC show deference national proceedings Article 17 decisions. Jurisprudence show tension sovereignty, genuine proceedings.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'While the International Criminal Court (ICC) has never explicitly adopted...' into 'ICC not adopt margin appreciation doctrine like ECtHR.'",
      "Step 2: Broke 'varying degrees of deference to national proceedings are evident...' into 'ICC show deference national proceedings Article 17 decisions.'",
      "Step 3: Divided 'This jurisprudential evolution demonstrates...' into 'Jurisprudence show tension sovereignty, genuine proceedings.'"
    ]
  },
  {
    "input": "The principle of complementarity, as enshrined in Article 17 of the Rome Statute, designates the ICC as a court of last resort that complements, not supplants, national courts. This foundational principle governs the ICC's exercise of jurisdiction, thereby operationalizing the admissibility regime which determines when the Court can properly intervene in a case.",
    "output": "Article 17 Complementarity makes ICC last resort court. Complementarity governs jurisdiction, admissibility regime decides intervention.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'principle of complementarity' as 'Complementarity' for compression.",
      "Step 2: Simplified 'designates the ICC as a court of last resort that complements, not supplants' to 'makes ICC last resort court'.",
      "Step 3: Condensed 'governs the ICC's exercise of jurisdiction, thereby operationalizing the admissibility regime' to 'governs jurisdiction, admissibility regime decides intervention'."
    ]
  },
  {
    "input": "In the Al-Senussi case, the Appeals Chamber of the ICC provided the most explicit acknowledgment of deference, asserting that the Court should grant 'a certain margin of appreciation to states with respect to the application of their national law to the facts of a case'. This determination underscored the primary responsibility vested in national jurisdictions for investigating and prosecuting international crimes.",
    "output": "In Al-Senussi case, Appeals Chamber assert Court grant margin appreciation states apply national law case facts. Determination underscore national jurisdictions responsibility investigate prosecute crimes.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'provided the most explicit acknowledgment of deference' to 'assert' to use an action verb.",
      "Step 2: Replaced 'with respect to the application of their national law to the facts of a case' with 'apply national law case facts'.",
      "Step 3: Converted 'underscored the primary responsibility vested in national jurisdictions' to 'underscore national jurisdictions responsibility'."
    ]
  },
  {
    "input": "Deference to national proceedings frequently appears implicitly through the Court's allocation of the burden of proof in admissibility challenges. While the initial burden rests with the challenging state, the Appeals Chamber in the Kenya cases stipulated that 'the State needs to provide the Court with evidence of a sufficient degree of specificity and probative value' regarding domestic proceedings, indicating a limited degree of deference.",
    "output": "Court allocates burden proof admissibility challenges. State provide specific probative evidence domestic proceedings. Limited deference shown.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'Deference to national proceedings frequently appears implicitly through' to 'Court allocates'.",
      "Step 2: Simplified 'the initial burden rests with the challenging state' to 'State provide'.",
      "Step 3: Condensed 'provide the Court with evidence of a sufficient degree of specificity and probative value' to 'provide specific probative evidence'."
    ]
  },
  {
    "input": "The Al-Senussi decision established a stringent threshold for ICC intervention based on procedural rights, determining that violations of a suspect's procedural rights would not per se render a case admissible. Such violations must be 'so egregious that the proceedings can no longer be regarded as being capable of providing any genuine form of justice to the suspect' to warrant ICC intervention.",
    "output": "pointcut execution(* assessProceduralRights(..)) {\n  checkViolations(egregiousThreshold);\n  requireNoGenuineJustice(suspect);\n}",
    "technique": "Pointcut Definition (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Defined a pointcut for assessing procedural rights in the Al-Senussi decision.",
      "Step 2: Specified checking for egregious violations.",
      "Step 3: Included requirement that proceedings lack genuine justice."
    ]
  },
  {
    "input": "The Kenya cases evinced a more limited degree of deference, as the Appeals Chamber rigorously applied the 'same person/same conduct' test. This necessitated Kenya to demonstrate specific and concrete evidence of investigative steps confirming that it was probing the same individuals for substantially the same conduct as the ICC Prosecutor, rejecting mere assertions of ongoing investigations.",
    "output": "class KenyaCases {\n  void applyDeference() {\n    return decorateWith('limitedDeference', 'samePersonConductTest');\n  }\n}\nclass EvidenceRequirement extends KenyaCases {\n  void applyDeference() {\n    return decorateWith('limitedDeference', 'samePersonConductTest', 'specificConcreteEvidence');\n  }\n}",
    "technique": "Decorator Pattern (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Created a base KenyaCases class for deference application.",
      "Step 2: Defined a method applying limited deference with the same person/conduct test.",
      "Step 3: Extended with EvidenceRequirement to add specific and concrete evidence.",
      "Step 4: Used decoration to enhance deference with evidence requirements."
    ]
  }
] [
  {
    "input": "The breadth of deference granted by the ICC is demonstrably influenced by the stage of national proceedings, with cases featuring more advanced domestic processes generally receiving greater deference. Furthermore, the quality and specificity of evidence pertaining to national proceedings significantly impacts the Court's willingness to defer, requiring concrete evidence over general claims.",
    "output": "ICC deference influenced stage national proceedings. Advanced processes receive greater deference. Evidence quality specificity impact Court willingness defer. Concrete evidence required over general claims.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'The breadth of deference granted by the ICC...' into 'ICC deference influenced stage national proceedings.'",
      "Step 2: Broke 'with cases featuring more advanced domestic processes...' into 'Advanced processes receive greater deference.'",
      "Step 3: Divided 'Furthermore, the quality and specificity of evidence...' into 'Evidence quality specificity impact Court willingness defer.'",
      "Step 4: Separated 'requiring concrete evidence over general claims' into 'Concrete evidence required over general claims.'"
    ]
  },
  {
    "input": "The International Criminal Court has consistently interpreted the 'genuineness' standard, crucial to Article 17, as possessing both subjective and objective components. The subjective aspect, 'willingness,' assesses whether proceedings are conducted in good faith and not to shield perpetrators, while the objective aspect, 'ability,' evaluates the state's capacity to obtain the accused, evidence, and testimony.",
    "output": "ICC interpret Genuineness standard Article 17. Genuineness include willingness, ability. Willingness assess good faith, not shield perpetrators. Ability evaluate state capacity obtain accused, evidence, testimony.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'genuineness' as 'Genuineness' to compress repetitive references.",
      "Step 2: Simplified 'has consistently interpreted the 'genuineness' standard, crucial to Article 17' to 'interpret Genuineness standard Article 17'.",
      "Step 3: Condensed 'subjective aspect, 'willingness,' assesses whether proceedings are conducted in good faith and not to shield' to 'Willingness assess good faith, not shield perpetrators'.",
      "Step 4: Shortened 'objective aspect, 'ability,' evaluates the state's capacity to obtain' to 'Ability evaluate state capacity obtain'."
    ]
  },
  {
    "input": "In assessing the 'willingness' component of genuineness, the jurisprudence indicates that 'the burden is on the Prosecutor to demonstrate that the national proceedings are vitiated by an unwillingness or inability to genuinely investigate or prosecute'. Conversely, the Court has demonstrated less deference when evaluating a state's 'ability,' particularly in volatile post-conflict environments, by focusing on objective inability factors.",
    "output": "Prosecutor demonstrate national proceedings vitiated unwillingness inability investigate prosecute. Court show less deference evaluate state ability volatile environments, focus objective inability factors.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'In assessing the 'willingness' component of genuineness, the jurisprudence indicates that' to focus on 'Prosecutor demonstrate'.",
      "Step 2: Reduced 'the burden is on the Prosecutor to demonstrate that the national proceedings are vitiated by an unwillingness or inability to genuinely investigate or prosecute' to 'national proceedings vitiated unwillingness inability investigate prosecute'.",
      "Step 3: Simplified 'Conversely, the Court has demonstrated less deference when evaluating a state's 'ability,' particularly in volatile post-conflict environments, by focusing on objective inability factors' to 'Court show less deference evaluate state ability volatile environments, focus objective inability factors'."
    ]
  },
  {
    "input": "Although the ICC has not adopted a formal margin of appreciation doctrine, concepts from the ECtHR's approach have indirectly influenced its jurisprudence. These include recognizing a presumption of good faith in states' exercise of discretion, albeit with the caveat that such deference is never unlimited, and incorporating a 'reasonableness' standard in its assessment of national proceedings.",
    "output": "ICC not adopt margin appreciation doctrine. ECtHR concepts influence jurisprudence. ICC recognize good faith state discretion. Deference limited, reasonableness standard assess proceedings.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'Although the ICC has not adopted...' into 'ICC not adopt margin appreciation doctrine.'",
      "Step 2: Broke 'concepts from the ECtHR's approach have indirectly influenced its jurisprudence' into 'ECtHR concepts influence jurisprudence.'",
      "Step 3: Divided 'These include recognizing a presumption of good faith...' into 'ICC recognize good faith state discretion.'",
      "Step 4: Separated 'albeit with the caveat that such deference is never unlimited, and incorporating a 'reasonableness' standard' into 'Deference limited, reasonableness standard assess proceedings.'"
    ]
  },
  {
    "input": "Analysis of ICC jurisprudence reveals a discernible pattern wherein cases involving high-level state officials typically receive heightened scrutiny and diminished deference. This approach reflects the Court's inherent concerns regarding the genuine willingness of states to effectively prosecute powerful figures within their own domestic systems.",
    "output": "ICC jurisprudence show pattern high-level officials receive scrutiny, less deference. Court concern state willingness prosecute powerful figures domestic systems.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'Analysis of' and 'reveals a discernible' to simplify to 'ICC jurisprudence show pattern'.",
      "Step 2: Condensed 'cases involving high-level state officials typically receive heightened scrutiny and diminished deference' to 'high-level officials receive scrutiny, less deference'.",
      "Step 3: Simplified 'reflects the Court's inherent concerns regarding the genuine willingness of states to effectively prosecute' to 'Court concern state willingness prosecute'."
    ]
  },
  {
    "input": "The contrasting outcomes in the Gaddafi and Al-Senussi cases (2013-2014) represented a pivotal period in the evolution of the ICC's deference jurisprudence. These decisions demonstrated a more nuanced approach, exhibiting greater deference on questions of a state's willingness while simultaneously applying strict scrutiny to ability factors.",
    "output": "Gaddafi, Al-Senussi cases contrast outcomes 2013-2014. Cases pivotal ICC deference jurisprudence evolution. Cases show nuanced approach, greater deference willingness, strict scrutiny ability.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Cases' as subject in 'Cases pivotal' and 'Cases show'.",
      "Step 2: Restated 'Gaddafi, Al-Senussi cases' explicitly in 'Gaddafi, Al-Senussi cases contrast outcomes'.",
      "Step 3: Simplified 'demonstrated a more nuanced approach, exhibiting greater deference' to 'show nuanced approach, greater deference'."
    ]
  },
  {
    "input": "While a formal doctrine remains undeveloped, the ICC's admissibility jurisprudence has established several key principles governing deference. These encompass the 'same person/same conduct' test as a foundational requirement, greater deference afforded to a state's willingness over its ability, and a stringent threshold for deeming due process violations sufficient to render proceedings 'non-genuine'. A requirement for concrete, specific evidence of national proceedings is also paramount.",
    "output": "pointcut execution(* establishDeferencePrinciples(..)) {\n  includeSamePersonConductTest(foundation);\n  prioritizeWillingnessDeference(overAbility);\n  setStringentThreshold(dueProcessViolations);\n  requireConcreteEvidence(nationalProceedings);\n}",
    "technique": "Pointcut Definition (Aspect-Oriented Programming)",
    "application_steps": [
      "Step 1: Defined a pointcut for establishing deference principles.",
      "Step 2: Included the same person/same conduct test as a foundation.",
      "Step 3: Specified prioritizing willingness over ability and stringent thresholds.",
      "Step 4: Added requirement for concrete evidence."
    ]
  },
  {
    "input": "During the Rome Statute negotiations, the deliberate selection of the term 'genuinely' over alternatives such as 'effectively' or 'in good faith' was significant. This choice aimed to establish a standard that prioritized the bona fide nature of national proceedings, ensuring respect for state sovereignty while simultaneously preventing impunity facilitated by merely superficial or 'sham' proceedings.",
    "output": "Rome Statute negotiations select genuinely over effectively, good faith. Choice establish standard prioritize bona fide proceedings. Standard respect sovereignty, prevent sham impunity.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'deliberate selection' to 'select' to use an action verb.",
      "Step 2: Replaced 'aimed to establish a standard that prioritized the bona fide nature' with 'establish standard prioritize bona fide'.",
      "Step 3: Converted 'preventing impunity facilitated by merely superficial or 'sham' proceedings' to 'prevent sham impunity'."
    ]
  },
  {
    "input": "Article 17 of the Rome Statute constitutes the primary legal framework for assessing 'genuineness,' stipulating that a case is inadmissible if investigated or prosecuted by a state, 'unless the State is unwilling or unable genuinely to carry out the investigation or prosecution'. Unwillingness factors include actions to shield individuals or unjustified delays, while inability refers to a 'total or substantial collapse or unavailability' of the national judicial system.",
    "output": "Article 17 framework assess Genuineness. Case inadmissible state investigate prosecute, unless state unwilling unable investigate prosecute. Unwillingness include shield actions, delays. Inability mean judicial system collapse unavailability.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Defined 'genuineness' as 'Genuineness' to compress references.",
      "Step 2: Simplified 'constitutes the primary legal framework for assessing' to 'framework assess'.",
      "Step 3: Condensed 'unwillingness factors include actions to shield individuals or unjustified delays' to 'Unwillingness include shield actions, delays'.",
      "Step 4: Shortened 'inability refers to a 'total or substantial collapse or unavailability'' to 'Inability mean judicial system collapse unavailability'."
    ]
  },
  {
    "input": "The ICC has definitively established that the assessment of genuineness is conducted at the time of the admissibility determination, rather than retrospectively. This assessment is subject to potential review if circumstances undergo significant changes, as permitted by Article 19(10) of the Rome Statute, and challenges are generally limited in frequency.",
    "output": "ICC establish genuineness assessment time admissibility determination. Assessment reviewed circumstances change, Article 19(10). Challenges limited frequency.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular verb form 'establish' to 'established'.",
      "Step 2: Generalized 'definitively established that the assessment of genuineness is conducted' to 'establish genuineness assessment'.",
      "Step 3: Simplified 'subject to potential review if circumstances undergo significant changes' to 'reviewed circumstances change'."
    ]
  },
  {
    "input": "In its substantive evaluation of unwillingness, the International Criminal Court has consistently underscored the intent underlying national proceedings over their mere quality or effectiveness. This methodological focus aims to uphold state sovereignty by ascertaining whether states are genuinely endeavoring to bring perpetrators to justice, irrespective of potential resource constraints or variances in procedural models.",
    "output": "ICC evaluate unwillingness focus intent national proceedings. ICC uphold sovereignty ascertain state endeavor bring perpetrators justice, despite resource constraints, procedural variances.",
    "technique": "Redundancy Elimination (Post-Colonial Discourse)",
    "application_steps": [
      "Step 1: Removed 'In its substantive evaluation of' to simplify to 'ICC evaluate'.",
      "Step 2: Condensed 'has consistently underscored the intent underlying national proceedings over their mere quality or effectiveness' to 'focus intent national proceedings'.",
      "Step 3: Simplified 'aims to uphold state sovereignty by ascertaining whether states are genuinely endeavoring' to 'uphold sovereignty ascertain state endeavor'."
    ]
  },
  {
    "input": "In the Gaddafi case, the Pre-Trial Chamber concluded that Libya was not genuinely investigating due to its inability to proceed, despite certain investigative steps already undertaken. The Court found that Libya could not obtain the accused, secure necessary testimony, or guarantee adequate due process, thereby highlighting strict scrutiny of a state's objective capacity.",
    "output": "Pre-Trial Chamber conclude Libya not investigate genuinely inability proceed. Libya undertake investigative steps. Court find Libya not obtain accused, secure testimony, guarantee due process. Finding highlight scrutiny state capacity.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split 'In the Gaddafi case, the Pre-Trial Chamber concluded...' into 'Pre-Trial Chamber conclude Libya not investigate genuinely inability proceed.'",
      "Step 2: Broke 'despite certain investigative steps already undertaken' into 'Libya undertake investigative steps.'",
      "Step 3: Divided 'The Court found that Libya could not...' into 'Court find Libya not obtain accused, secure testimony, guarantee due process.'",
      "Step 4: Separated 'thereby highlighting strict scrutiny...' into 'Finding highlight scrutiny state capacity.'"
    ]
  },
  {
    "input": "The Pre-Trial Chamber rejected Côte d'Ivoire's admissibility challenge in the Simone Gbagbo case, ruling the domestic investigation was not genuine because it concentrated on economic crimes rather than the crimes against humanity charged by the ICC. This decision emphasized that for proceedings to be genuine, they must investigate substantially the same conduct alleged within the ICC's jurisdiction, not merely related offenses.",
    "output": "Pre-Trial Chamber reject Côte d'Ivoire challenge Simone Gbagbo case. Domestic investigation not genuine, focus economic crimes, not ICC crimes against humanity. Proceedings genuine investigate same conduct ICC jurisdiction, not related offenses.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated 'Pre-Trial Chamber' as subject in 'Pre-Trial Chamber reject'.",
      "Step 2: Restated 'Domestic investigation' explicitly in 'Domestic investigation not genuine'.",
      "Step 3: Repeated 'Proceedings' in 'Proceedings genuine investigate same conduct'."
    ]
  },
  {
    "input": "The Appeals Chamber has been instrumental in refining the genuineness standard, striving to balance respect for state sovereignty and the imperative of preventing impunity through sham proceedings. This intricate balancing act is prominently illustrated by the nuanced and often contrasting assessments observed in cases such as Gaddafi and Al-Senussi.",
    "output": "Appeals Chamber refine genuineness standard balance sovereignty, prevent impunity sham proceedings. Balancing act illustrated contrasting assessments Gaddafi, Al-Senussi cases.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Changed 'has been instrumental in refining' to 'refine' to use an action verb.",
      "Step 2: Replaced 'striving to balance respect for state sovereignty and the imperative of preventing impunity' with 'balance sovereignty, prevent impunity'.",
      "Step 3: Converted 'is prominently illustrated by the nuanced and often contrasting assessments observed' to 'illustrated contrasting assessments'."
    ]
  },
  {
    "input": "The International Criminal Court (ICC) operates as a court of last resort, stepping in only when national courts are unwilling or unable to prosecute serious crimes like genocide, war crimes, and crimes against humanity. This principle, known as complementarity, is outlined in Article 17 of the Rome Statute and dictates that the ICC is intended to complement, not replace, national criminal jurisdictions.",
    "output": "ICC last resort court. ICC intervene national courts unwilling unable prosecute genocide, war crimes, crimes against humanity. Complementarity Article 17 Rome Statute complement national jurisdictions.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Stripped 'The International Criminal Court (ICC) operates as' to focus on 'ICC last resort court'.",
      "Step 2: Reduced 'stepping in only when national courts are unwilling or unable to prosecute serious crimes like' to 'intervene national courts unwilling unable prosecute'.",
      "Step 3: Simplified 'This principle, known as complementarity, is outlined in Article 17 of the Rome Statute and dictates that the ICC is intended to complement, not replace' to 'Complementarity Article 17 Rome Statute complement national jurisdictions'."
    ]
  },
  {
    "input": "Article 17 of the Rome Statute operationalizes the complementarity principle, setting out the specific conditions under which a case may be deemed inadmissible before the ICC. The ICC applies a two-step test: first, determining if national proceedings exist for the same person and conduct; second, assessing whether those proceedings reflect genuine willingness and ability. If no relevant national proceeding is underway—a situation of 'inactivity'—the case is automatically admissible before the ICC without needing to examine unwillingness or inability.",
    "output": "pipeline {\n  stage1: checkNationalProceedings(samePersonConduct);\n  stage2: assessGenuineWillingnessAbility(proceedings);\n  stage3: handleInactivity(automaticAdmissibility);\n}",
    "technique": "Pipeline (Concurrency)",
    "application_steps": [
      "Step 1: Created a pipeline with three stages for complementarity assessment.",
      "Step 2: Stage1 checks for national proceedings with same person and conduct.",
      "Step 3: Stage2 assesses genuine willingness and ability.",
      "Step 4: Stage3 handles inactivity leading to automatic admissibility."
    ]
  },
  {
    "input": "ICC jurisprudence crystallized around the 'same person/same conduct' test, requiring 'substantially the same conduct' to be under investigation nationally as that charged by the ICC. The Appeals Chamber clarified that the 'defining elements of a concrete case before the Court are the individual and the alleged conduct'. This means that both the specific person and the underlying incidents or acts must coincide for a national proceeding to preclude ICC admissibility.",
    "output": "fork {\n  task1: verifyIndividual(nationalInvestigation, iccCase);\n  task2: verifySubstantiallySameConduct(nationalInvestigation, iccCharges);\n}\njoin {\n  result: combine(task1, task2, precludeAdmissibility);\n}",
    "technique": "Fork-Join (Concurrency)",
    "application_steps": [
      "Step 1: Split the test into two parallel tasks: verifying individual and conduct.",
      "Step 2: Assigned task1 to verify the same individual.",
      "Step 3: Assigned task2 to verify substantially same conduct.",
      "Step 4: Joined results to determine admissibility preclusion."
    ]
  },
  {
    "input": "The inclusion of the qualifier 'substantially' in 'same conduct' indicates that absolute identity is not required for complementarity purposes. Minor divergences in legal characterization or detail will not defeat admissibility so long as the essence of the conduct is the same. This phrasing was carefully chosen by the Appeals Chamber to allow some flexibility, for instance, if a State prosecutes a suspect for murder whereas the ICC case is for persecution based on the same killings.",
    "output": "Qualifier substantially same conduct mean absolute identity not required. Minor divergences not defeat admissibility, essence conduct same. Appeals Chamber choose phrasing flexibility, state prosecute murder, ICC prosecute persecution same killings.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular verb form 'mean' to 'indicates'.",
      "Step 2: Generalized 'indicates that absolute identity is not required' to 'mean absolute identity not required'.",
      "Step 3: Simplified 'was carefully chosen by the Appeals Chamber to allow some flexibility' to 'choose phrasing flexibility'."
    ]
  },
  {
    "input": "The ICC assesses 'unwillingness' by considering specific indicators outlined in Article 17(2). These include whether national proceedings were undertaken 'for the purpose of shielding the person concerned from criminal responsibility'. Unwillingness is also indicated by an 'unjustified delay inconsistent with intent to bring the person to justice,' or if proceedings 'are not being conducted independently or impartially'.",
    "output": "ICC assess unwillingness Article 17(2) indicators. Indicators include shielding proceedings, unjustified delay, non-independent proceedings.",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Removed 'by considering specific indicators outlined in' to simplify to 'Article 17(2) indicators'.",
      "Step 2: Condensed 'whether national proceedings were undertaken for the purpose of shielding the person concerned from criminal responsibility' to 'shielding proceedings'.",
      "Step 3: Simplified 'unjustified delay inconsistent with intent to bring the person to justice' to 'unjustified delay'.",
      "Step 4: Shortened 'proceedings are not being conducted independently or impartially' to 'non-independent proceedings'."
    ]
  },
  {
    "input": "The term 'inability' concerns whether the State’s judicial system is objectively capable of handling a case, as provided for in Article 17(3). This test ties inability to 'a total or substantial collapse or unavailability of the national judicial system'. It also includes a state's inability to obtain the accused, necessary evidence and testimony, or otherwise carry out its proceedings.",
    "output": "Inability concern state judicial system capability handle case. Article 17(3) tie inability collapse unavailability judicial system. Inability include not obtain accused, evidence, testimony, carry proceedings.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'the' from 'The term inability'.",
      "Step 2: Omitted auxiliary verbs like 'is' in 'is objectively capable'.",
      "Step 3: Dropped prepositions like 'of' in 'of handling a case'.",
      "Step 4: Eliminated conjunctions like 'and' in 'evidence and testimony'."
    ]
  }
]
[
  {
    "input": "Unwillingness, as defined in Article 17(2), considers whether national proceedings were undertaken to shield the person from ICC jurisdiction, or if there has been an unjustified delay inconsistent with an intent to bring the person to justice, or if proceedings were not conducted independently or impartially. This is described as a subjective criterion, pertaining to a State’s intentions, and is thus challenging to prove.",
    "output": "Void",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive legal phrases like 'unjustified delay inconsistent with an intent to bring the person to justice'.",
      "Step 2: Consolidated the phrase to 'void' to eliminate redundancy.",
      "Step 3: Ensured the output retains the core implication of invalidity."
    ]
  },
  {
    "input": "Inability, as defined in Article 17(3), considers whether, due to a total or substantial collapse or unavailability of the national judicial system, the State cannot obtain the accused, necessary evidence and testimony, or otherwise carry out its proceedings. This criterion reflects an objective assessment of the State's factual capacity to handle the case.",
    "output": "The State cannot handle the case due to a collapsed judicial system.",
    "technique": "Active Voice Conversion (Legal)",
    "application_steps": [
      "Step 1: Identified passive construction 'the State cannot obtain the accused, necessary evidence and testimony'.",
      "Step 2: Converted to active voice by emphasizing the State as the actor.",
      "Step 3: Simplified to directly state the outcome of the collapsed system."
    ]
  },
  {
    "input": "The term 'genuinely' qualifies both 'unwilling' and 'unable' in Article 17(1)(a) and (b), signifying that the assessment goes beyond mere appearances and requires an evaluation of the bona fides of the national proceedings. A 'genuine' investigation or prosecution implies a real commitment by the state to bring perpetrators to justice.",
    "output": "Evaluate the state's commitment to prosecute.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Identified nominalizations like 'evaluation of the bona fides' and 'commitment'.",
      "Step 2: Converted nouns to verbs, changing 'evaluation' to 'evaluate' and 'commitment' to 'commit'.",
      "Step 3: Simplified to focus on the action of evaluating prosecution efforts."
    ]
  },
  {
    "input": "Beyond the admissibility criteria in Article 17, Article 53 provides the ICC Prosecutor with a distinct ground for potentially halting proceedings: the 'interests of justice'. Even if a situation falls within the Court's jurisdiction and a potential case appears admissible, the Prosecutor may decline to investigate or prosecute if doing so would not serve these interests.",
    "output": "Define 'Justice Interests' as the Prosecutor's basis for halting proceedings. If a case is admissible, the Prosecutor may stop Justice Interests if they are not served.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive phrase 'interests of justice'.",
      "Step 2: Defined it as 'Justice Interests' for brevity.",
      "Step 3: Replaced subsequent references with the defined term and condensed the sentence."
    ]
  },
  {
    "input": "A significant debate exists regarding whether the 'interests of justice' assessment can legitimately encompass broader considerations, particularly those related to peace and security. The OTP's 2007 policy paper acknowledged this debate and suggested a willingness to consider 'various national and international efforts to achieve peace and security' as a factor, while historically exercising caution in explicitly invoking Article 53 based on peace considerations.",
    "output": "Debate exist. Interests justice assessment encompass peace security. OTP 2007 paper suggest consider national international efforts achieve peace security. Caution invoke Article 53 peace.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'a' and 'the'.",
      "Step 2: Omitted auxiliary verbs such as 'can' and 'to'.",
      "Step 3: Stripped prepositions and conjunctions like 'of' and 'and' to mimic telegraphic speech."
    ]
  },
  {
    "input": "The ICC does not automatically deem a case inadmissible simply because a peace process is underway; rather, it scrutinizes the concrete impact of that process on the likelihood of genuine national accountability proceedings for the specific case before it. Early-stage negotiations or agreements with uncertain implementation prospects are unlikely to meet the Article 17 threshold for inadmissibility.",
    "output": "ICC scrutinizes peace process impact on accountability proceedings.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (ICC), action (scrutinizes), and patient (peace process impact).",
      "Step 2: Removed modifiers and clauses like 'simply because' and 'early-stage negotiations'.",
      "Step 3: Preserved core semantic components in a simplified structure."
    ]
  },
  {
    "input": "Conversely, a well-established and functioning mechanism born from a peace process, demonstrably undertaking genuine proceedings relevant to potential ICC cases, can lead to a finding of inadmissibility. The closure of Colombia’s preliminary examination in 2021 reflected confidence in its Special Jurisdiction for Peace (JEP) and other national mechanisms as genuine national efforts.",
    "output": "Peace process mechanism undertakes genuine proceedings. Colombia’s examination closed. Special Jurisdiction for Peace genuine.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Broke complex sentence into three single-proposition sentences.",
      "Step 2: Separated clauses about mechanism, Colombia’s examination, and JEP.",
      "Step 3: Simplified each segment to convey one idea clearly."
    ]
  },
  {
    "input": "While Article 17 focuses on the status and genuineness of national judicial proceedings, broader concerns about peace and stability often form an unavoidable backdrop to ICC interventions. Although stability is not an explicit legal criterion for admissibility, such factors can implicitly influence OTP strategic decision-making.",
    "output": "Article 17 focused status genuineness judicial proceedings. Peace stability concerns shaped ICC interventions. Stability not legal criterion. Factors influenced OTP decision-making.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular past tense '-ed' to verbs 'focus', 'form', and 'influence'.",
      "Step 2: Generalized sentence structure to simple past tense for consistency.",
      "Step 3: Segmented into four sentences to mimic child-like grammar."
    ]
  },
  {
    "input": "The concept of 'positive complementarity' represents a shift from viewing complementarity primarily as a jurisdictional test to actively encouraging, supporting, and assisting national jurisdictions. This approach involves the ICC system working to enable states to fulfill their primary responsibility to investigate and prosecute Rome Statute crimes domestically.",
    "output": "Positive complementarity shift encouraged jurisdictions. ICC system enabled states investigated prosecuted crimes.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated subjects 'Positive complementarity' and 'ICC system' to avoid pronouns.",
      "Step 2: Simplified verbs to past tense for consistency.",
      "Step 3: Split into two sentences to reduce referential ambiguity."
    ]
  },
  {
    "input": "The OTP's 2024 Policy on Complementarity and Cooperation formally consolidates this approach, framing the ICC not as an 'apex' court but as a 'hub' within a network of accountability efforts. The policy emphasizes partnership with states, civil society, and regional organizations, aiming to bring justice closer to affected communities.",
    "output": "The 2024 OTP Policy simplifies ICC as a hub for accountability. It promotes partnerships to deliver justice.",
    "technique": "Fine-Tuned Sequence-to-Sequence Simplification (AI)",
    "application_steps": [
      "Step 1: Treated input as complex sentence for monolingual translation.",
      "Step 2: Applied lexical substitution, replacing 'consolidates' with 'simplifies'.",
      "Step 3: Split and rephrased to focus on core ideas of hub and partnerships."
    ]
  },
  {
    "input": "A significant challenge within the complementarity assessment is whether transitional justice mechanisms (TJMs) other than formal criminal prosecution, such as truth commissions or traditional justice rituals, can qualify as the type of national 'activity' that would render a case inadmissible under Article 17(1)(a) or (b). Scholarly opinion on this matter is divided, with some arguing for a narrow interpretation requiring criminal justice investigations.",
    "output": "Challenge whether TJMs qualify as activity under Article 17. TJMs like truth commissions, justice rituals. Scholars argue narrow interpretation criminal investigations.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'a' and 'the'.",
      "Step 2: Omitted prepositions such as 'of' and 'for'.",
      "Step 3: Simplified sentence structure to mimic telegraphic speech."
    ]
  },
  {
    "input": "Blanket amnesties, particularly those granted by perpetrators to themselves or those that unconditionally absolve individuals of responsibility for genocide, crimes against humanity, or war crimes, are generally viewed as incompatible with the international legal obligation to combat impunity. Such measures could be interpreted as evidence of 'unwillingness' under Article 17.",
    "output": "Amnesties absolve perpetrators of crimes. Amnesties show unwillingness under Article 17.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (amnesties), action (absolve), and patient (perpetrators).",
      "Step 2: Removed modifiers like 'particularly those granted by perpetrators'.",
      "Step 3: Added second sentence to preserve unwillingness reference."
    ]
  },
  {
    "input": "The ICC's approach in the Colombian situation suggests a significant degree of flexibility regarding sentencing outcomes within the complementarity assessment. It demonstrates a willingness to accept nationally-designed, context-specific justice solutions emerging from peace agreements, provided the underlying process meets the threshold of 'genuineness' in its intent and execution.",
    "output": "ICC approach Colombia showed flexibility sentencing. ICC accepted national justice solutions peace agreements. Process met genuineness.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split input into three single-proposition sentences.",
      "Step 2: Separated flexibility, acceptance of solutions, and genuineness threshold.",
      "Step 3: Simplified each segment for clarity."
    ]
  },
  {
    "input": "UN Security Council (UNSC) referrals under Article 13(b) of the Rome Statute, made pursuant to Chapter VII of the UN Charter, represent a powerful trigger for ICC jurisdiction, allowing the Court to investigate situations in states that are not parties. This mechanism effectively bypasses the need for the referred state's consent and can preempt potential admissibility challenges, particularly when the government is clearly unwilling to prosecute.",
    "output": "UNSC referrals trigger ICC jurisdiction. Mechanism bypasses state consent. Mechanism preempts admissibility challenges.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Divided complex sentence into three simpler sentences.",
      "Step 2: Separated jurisdiction trigger, consent bypass, and admissibility preemption.",
      "Step 3: Simplified wording to focus on core actions."
    ]
  },
  {
    "input": "The International Criminal Court (ICC) operates as a court of last resort, intervening only when national courts are unwilling or unable to prosecute serious crimes like genocide, war crimes, and crimes against humanity. This principle, known as complementarity, is outlined in Article 17 of the Rome Statute.",
    "output": "ICC intervenes when courts fail to prosecute crimes. Complementarity outlined in Article 17.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (ICC), action (intervenes), and condition (courts fail).",
      "Step 2: Removed modifiers like 'court of last resort' and specific crime lists.",
      "Step 3: Added second sentence to preserve complementarity reference."
    ]
  },
  {
    "input": "Article 17 of the Rome Statute operationalizes the complementarity principle, setting out the specific conditions under which a case may be deemed inadmissible before the ICC. The core of Article 17 lies in its deference to genuine national proceedings, prioritizing the primary right and responsibility of states to investigate and prosecute the most serious crimes of international concern.",
    "output": "Article 17 sets conditions for inadmissibility. Article 17 defers to genuine proceedings. States investigate serious crimes.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split input into three single-proposition sentences.",
      "Step 2: Separated conditions, deference, and state responsibility.",
      "Step 3: Simplified each segment to convey one idea."
    ]
  },
  {
    "input": "A case is inadmissible if a state with jurisdiction is actively investigating or prosecuting it (Article 17(1)(a)), or if the state has investigated and decided not to prosecute (Article 17(1)(b)), or if the person has already been tried for the same conduct (Article 17(1)(c)). However, the ICC may still proceed if the state is found to be 'unwilling or unable genuinely' to carry out the investigation or prosecution. This 'unwilling or unable genuinely' test is the mechanism through which the ICC ensures that complementarity does not become a shield for impunity.",
    "output": "Case inadmissible state investigated prosecuted. ICC proceeded state unwilling unable genuinely.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'a' and 'the'.",
      "Step 2: Omitted prepositions and conjunctions like 'if' and 'or'.",
      "Step 3: Simplified to telegraphic style, retaining core conditions."
    ]
  },
  {
    "input": "The very structure of the complementarity principle reflects an inherent tension, emerging as a compromise between delegations advocating for a court with strong jurisdiction to combat impunity and those prioritizing the protection of state sovereignty. This underlying tension inevitably shapes how the criteria for admissibility, particularly the assessment of 'unwillingness' and 'inability,' are interpreted and applied.",
    "output": "Complementarity tension compromised sovereignty jurisdiction. Tension shaped unwillingness inability assessment.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (complementarity), action (reflects), and patient (tension).",
      "Step 2: Removed modifiers like 'inherent' and delegate details.",
      "Step 3: Added second sentence to preserve tension’s impact on assessment."
    ]
  },
  {
    "input": "The ICC's mandate, as derived from the Rome Statute, is primarily focused on ending impunity for the perpetrators of the most serious crimes and contributing to the prevention of such crimes. The ICC primarily delivers retributive justice focused on individual criminal responsibility and punishment, which differs substantially from other transitional justice mechanisms.",
    "output": "ICC mandate ends impunity for crimes. ICC delivers justice.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (ICC), action (ends), and patient (impunity).",
      "Step 2: Removed modifiers like 'most serious' and transitional justice comparison.",
      "Step 3: Added second sentence to preserve justice delivery focus."
    ]
  },
  {
    "input": "ICC jurisprudence has established that for national proceedings to preclude ICC admissibility, the state must demonstrate 'tangible, concrete and progressive' investigative or prosecutorial steps regarding the specific case. The 'case' is defined by the specific individual and substantially the same conduct alleged in the ICC proceedings.",
    "output": "State demonstrates tangible steps to preclude admissibility. Case defines individual and conduct.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split input into two single-proposition sentences.",
      "Step 2: Separated demonstration of steps and case definition.",
      "Step 3: Simplified wording to focus on core actions."
    ]
  }
] [
  {
    "input": "In order to determine unwillingness, the Court shall consider whether the proceedings were or are being undertaken for the purpose of shielding the person concerned from criminal responsibility for crimes within the jurisdiction of the Court referred to in article 5.",
    "output": "Void",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive phrase 'for the purpose of shielding the person concerned from criminal responsibility'.",
      "Step 2: Consolidated to 'void' to eliminate redundancy.",
      "Step 3: Retained core implication of invalid proceedings."
    ]
  },
  {
    "input": "In order to determine unwillingness, the Court shall consider whether there has been an unjustified delay in the proceedings which in the circumstances is inconsistent with an intent to bring the person concerned to justice.",
    "output": "The Court finds delay blocks justice.",
    "technique": "Active Voice Conversion (Legal)",
    "application_steps": [
      "Step 1: Identified passive construction 'there has been an unjustified delay'.",
      "Step 2: Converted to active voice with 'Court finds' as the actor.",
      "Step 3: Simplified to emphasize delay’s impact on justice."
    ]
  },
  {
    "input": "In order to determine unwillingness, the Court shall consider whether the proceedings were not or are not being conducted independently or impartially, and they were or are being conducted in a manner which, in the circumstances, is inconsistent with an intent to bring the person concerned to justice.",
    "output": "Assess if Court proceedings lack impartiality.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Identified nominalization 'consideration' and 'intent'.",
      "Step 2: Converted to verbs 'assess' and implied action 'lack'.",
      "Step 3: Simplified to focus on assessing impartiality."
    ]
  },
  {
    "input": "In order to determine inability in a particular case, the Court shall consider whether, due to a total or substantial collapse or unavailability of its national judicial system, the State is unable to obtain the accused or the necessary evidence and testimony or otherwise unable to carry out its proceedings.",
    "output": "Define 'Judicial Collapse' as State’s inability basis. Court checks if Judicial Collapse prevents proceedings.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive 'total or substantial collapse or unavailability'.",
      "Step 2: Defined as 'Judicial Collapse' for brevity.",
      "Step 3: Replaced references with defined term and condensed."
    ]
  },
  {
    "input": "When a situation has been referred to the Court pursuant to article 13(a) and the Prosecutor has determined that there would be a reasonable basis to commence an investigation, the Prosecutor shall notify all States Parties and those States which would normally exercise jurisdiction over the crimes concerned.",
    "output": "Situation referred Court. Prosecutor determine investigation basis. Prosecutor notify States.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles 'a' and 'the'.",
      "Step 2: Omitted auxiliary verbs 'has' and 'would'.",
      "Step 3: Stripped prepositions 'to' and 'over' for telegraphic style."
    ]
  },
  {
    "input": "Within one month of receipt of that notification, a State may inform the Court that it is investigating or has investigated its nationals or others within its jurisdiction with respect to criminal acts which may constitute crimes referred to in article 5 and which relate to the subject of the notification.",
    "output": "State informs Court of investigation.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified agent (State), action (inform), and patient (Court).",
      "Step 2: Removed modifiers like 'within one month' and 'with respect to'.",
      "Step 3: Simplified to core agent-action-patient structure."
    ]
  },
  {
    "input": "If the Prosecutor defers an investigation pursuant to a State’s request under article 18(2), the Prosecutor may request that the State concerned periodically inform the Prosecutor of the progress of its investigations and any subsequent prosecutions.",
    "output": "Prosecutor defer investigation. Prosecutor request State inform progress. State investigate prosecute.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split into three single-proposition sentences.",
      "Step 2: Separated deferral, request, and State action.",
      "Step 3: Simplified each segment for clarity."
    ]
  },
  {
    "input": "The Court shall satisfy itself that it has jurisdiction in any case brought before it. The Court may, on its own motion, determine the admissibility of a case in accordance with article 17.",
    "output": "Court satisfied jurisdiction. Court determined admissibility Article 17.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular past tense '-ed' to 'satisfy' and 'determine'.",
      "Step 2: Simplified to two sentences with generalized grammar.",
      "Step 3: Retained core jurisdiction and admissibility focus."
    ]
  },
  {
    "input": "Challenges to the admissibility of a case on the grounds referred to in article 17 or challenges to the jurisdiction of the Court may be made by an accused or a person for whom a warrant of arrest or a summons to appear has been issued under article 58.",
    "output": "Accused person challenged admissibility Article 17. Accused person challenged Court jurisdiction.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated subject 'Accused person' to avoid pronouns.",
      "Step 2: Split into two sentences for clarity.",
      "Step 3: Simplified to focus on challenges."
    ]
  },
  {
    "input": "Challenges to the admissibility of a case on the grounds referred to in article 17 or challenges to the jurisdiction of the Court may be made by a State which has jurisdiction over a case, on the ground that it is investigating or prosecuting the case or has investigated or prosecuted.",
    "output": "State simplifies challenges to admissibility and jurisdiction.",
    "technique": "Fine-Tuned Sequence-to-Sequence Simplification (AI)",
    "application_steps": [
      "Step 1: Treated as complex sentence for translation.",
      "Step 2: Substituted 'made by' with 'simplifies' and condensed clauses.",
      "Step 3: Rephrased to focus on State’s challenge action."
    ]
  },
  {
    "input": "Challenges to the admissibility of a case on the grounds referred to in article 17 or challenges to the jurisdiction of the Court may be made by a State from which acceptance of jurisdiction is required under article 12.",
    "output": "State challenge admissibility jurisdiction Article 17 Article 12.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles 'a' and 'the'.",
      "Step 2: Omitted prepositions 'to' and 'from'.",
      "Step 3: Simplified to telegraphic style."
    ]
  },
  {
    "input": "The Prosecutor may seek a ruling from the Court regarding a question of jurisdiction or admissibility. In proceedings with respect to jurisdiction or admissibility, those who have referred the situation under article 13, as well as victims, may also submit observations to the Court.",
    "output": "Prosecutor seek ruling. Victims submit observations.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified agents (Prosecutor, victims) and actions (seek, submit).",
      "Step 2: Removed modifiers like 'regarding a question of jurisdiction'.",
      "Step 3: Simplified to core agent-action structure."
    ]
  },
  {
    "input": "Except as provided in this Statute, no person shall be tried before the Court with respect to conduct which formed the basis of crimes for which the person has been convicted or acquitted by the Court.",
    "output": "Person not tried Court. Person convicted acquitted Court.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split into two single-proposition sentences.",
      "Step 2: Separated trial prohibition and conviction/acquittal status.",
      "Step 3: Simplified each segment for clarity."
    ]
  },
  {
    "input": "No person shall be tried by another court for a crime referred to in article 5 for which that person has already been convicted or acquitted by the Court.",
    "output": "Court acquitted convicted person already has which 5 article in to referred crime a for court another by tried be shall person No.",
    "technique": "Melodic Retrograde (Music)",
    "application_steps": [
      "Step 1: Treated sentence as a 'melody' of words.",
      "Step 2: Reversed word order (last to first) for retrograde effect.",
      "Step 3: Kept punctuation for readability, producing absurd result."
    ]
  },
  {
    "input": "No person who has been tried by another court for conduct also proscribed under article 6, 7, 8 or 8 bis shall be tried by the Court with respect to the same conduct unless the proceedings in the other court were for the purpose of shielding the person concerned from criminal responsibility for crimes within the jurisdiction of the Court.",
    "output": "Person not tried Court same conduct. Other court shield person crimes.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split into two single-proposition sentences.",
      "Step 2: Separated trial prohibition and shielding purpose.",
      "Step 3: Simplified each segment for clarity."
    ]
  },
  {
    "input": "No person who has been tried by another court for conduct also proscribed under article 6, 7, 8 or 8 bis shall be tried by the Court with respect to the same conduct unless the proceedings in the other court were not conducted independently or impartially in accordance with the norms of due process recognized by international law and were conducted in a manner which, in the circumstances, was inconsistent with an intent to bring the person concerned to justice.",
    "output": "Person not tried Court conduct. Other court lack impartiality justice.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified agent (person), action (not tried), and condition (other court’s impartiality).",
      "Step 2: Removed modifiers like 'in accordance with the norms'.",
      "Step 3: Simplified to core structure with two sentences."
    ]
  },
  {
    "input": "In the case of article 13, paragraph (a) or (c), the Court may exercise its jurisdiction if the State on the territory of which the conduct in question occurred or, if the crime was committed on board a vessel or aircraft, the State of registration of that vessel or aircraft, is a Party to this Statute or has accepted the jurisdiction of the Court.",
    "output": "Court exercise jurisdiction State accept Statute. Crime occur vessel State register.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles 'the' and 'a'.",
      "Step 2: Omitted prepositions 'of' and 'on'.",
      "Step 3: Simplified to telegraphic style."
    ]
  },
  {
    "input": "In the case of article 13, paragraph (a) or (c), the Court may exercise its jurisdiction if the State of which the person accused of the crime is a national is a Party to this Statute or has accepted the jurisdiction of the Court.",
    "output": "Court exercise jurisdiction slowly. State national accept Statute gradually.",
    "technique": "Melodic Augmentation (Music)",
    "application_steps": [
      "Step 1: Treated sentence rhythm as musical notes.",
      "Step 2: Augmented by adding adverbs (slowly, gradually) to extend 'rhythm'.",
      "Step 3: Applied to segmented sentences for absurd effect."
    ]
  },
  {
    "input": "The Court may exercise its jurisdiction with respect to a crime referred to in article 5 if a situation in which one or more of such crimes appears to have been committed is referred to the Prosecutor by a State Party in accordance with article 14.",
    "output": "Court exercise jurisdiction crime referred Prosecutor. State Party refer situation Article 14.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split into two single-proposition sentences.",
      "Step 2: Separated jurisdiction exercise and referral action.",
      "Step 3: Simplified each segment for clarity."
    ]
  },
  {
    "input": "The Court may exercise its jurisdiction with respect to a crime referred to in article 5 if a situation in which one or more of such crimes appears to have been committed is referred to the Prosecutor by the Security Council acting under Chapter VII of the Charter of the United Nations.",
    "output": "Court exercise jurisdiction fast. Security Council refer situation quick.",
    "technique": "Melodic Diminution (Music)",
    "application_steps": [
      "Step 1: Treated sentence rhythm as musical notes.",
      "Step 2: Diminished by adding adverbs (fast, quick) to shorten 'rhythm'.",
      "Step 3: Applied to segmented sentences for absurd effect."
    ]
  }
] [
  {
    "input": "Unwillingness, as defined in Article 17(2), considers whether national proceedings were undertaken to shield the person from ICC jurisdiction, or if there has been an unjustified delay inconsistent with an intent to bring the person to justice, or if proceedings were not conducted independently or impartially. This is described as a subjective criterion, pertaining to a State’s intentions, and is thus challenging to prove.",
    "output": "Justice intent lacking.",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive phrases like 'unjustified delay inconsistent with an intent'.",
      "Step 2: Consolidated to 'justice intent lacking' to remove redundancy.",
      "Step 3: Retained core implication of unwillingness."
    ]
  },
  {
    "input": "Inability, as defined in Article 17(3), considers whether, due to a total or substantial collapse or unavailability of the national judicial system, the State cannot obtain the accused, necessary evidence and testimony, or otherwise carry out its proceedings. This criterion reflects an objective assessment of the State's factual capacity to handle the case.",
    "output": "State fails to prosecute due to judicial collapse.",
    "technique": "Active Voice Conversion (Legal)",
    "application_steps": [
      "Step 1: Identified passive construction 'State cannot obtain the accused'.",
      "Step 2: Converted to active voice with 'State fails' as the actor.",
      "Step 3: Simplified to emphasize judicial collapse as cause."
    ]
  },
  {
    "input": "The term 'genuinely' qualifies both 'unwilling' and 'unable' in Article 17(1)(a) and (b), signifying that the assessment goes beyond mere appearances and requires an evaluation of the bona fides of the national proceedings. A 'genuine' investigation or prosecution implies a real commitment by the state to bring perpetrators to justice.",
    "output": "Assess state’s prosecution commitment.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Identified nominalizations like 'evaluation' and 'commitment'.",
      "Step 2: Converted to verbs 'assess' and 'commit'.",
      "Step 3: Simplified to focus on assessing prosecution action."
    ]
  },
  {
    "input": "Beyond the admissibility criteria in Article 17, Article 53 provides the ICC Prosecutor with a distinct ground for potentially halting proceedings: the 'interests of justice'. Even if a situation falls within the Court's jurisdiction and a potential case appears admissible, the Prosecutor may decline to investigate or prosecute if doing so would not serve these interests.",
    "output": "Define 'Justice Ground' as Prosecutor’s halt basis. Prosecutor may stop Justice Ground if not served.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive 'interests of justice'.",
      "Step 2: Defined as 'Justice Ground' for brevity.",
      "Step 3: Replaced references with defined term and condensed."
    ]
  },
  {
    "input": "A significant debate exists regarding whether the 'interests of justice' assessment can legitimately encompass broader considerations, particularly those related to peace and security. The OTP's 2007 policy paper acknowledged this debate and suggested a willingness to consider 'various national and international efforts to achieve peace and security' as a factor, while historically exercising caution in explicitly invoking Article 53 based on peace considerations.",
    "output": "Debate exist. Justice assessment include peace security. OTP paper suggest consider efforts peace security. Caution use Article 53 peace.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles 'a' and 'the'.",
      "Step 2: Omitted auxiliary verbs 'can' and 'to'.",
      "Step 3: Stripped prepositions 'of' and conjunctions 'and'."
    ]
  },
  {
    "input": "The ICC does not automatically deem a case inadmissible simply because a peace process is underway; rather, it scrutinizes the concrete impact of that process on the likelihood of genuine national accountability proceedings for the specific case before it. Early-stage negotiations or agreements with uncertain implementation prospects are unlikely to meet the Article 17 threshold for inadmissibility.",
    "output": "ICC checks peace process effect on accountability.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified agent (ICC), action (scrutinizes), and patient (peace process impact).",
      "Step 2: Removed modifiers like 'simply because' and 'early-stage negotiations'.",
      "Step 3: Simplified to core agent-action-patient structure."
    ]
  },
  {
    "input": "Conversely, a well-established and functioning mechanism born from a peace process, demonstrably undertaking genuine proceedings relevant to potential ICC cases, can lead to a finding of inadmissibility. The closure of Colombia’s preliminary examination in 2021 reflected confidence in its Special Jurisdiction for Peace (JEP) and other national mechanisms as genuine national efforts.",
    "output": "Peace mechanism start genuine proceedings. Colombia examination closed. JEP genuine.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split into three single-proposition sentences.",
      "Step 2: Separated mechanism action, Colombia closure, and JEP status.",
      "Step 3: Simplified each segment for clarity."
    ]
  },
  {
    "input": "While Article 17 focuses on the status and genuineness of national judicial proceedings, broader concerns about peace and stability often form an unavoidable backdrop to ICC interventions. Although stability is not an explicit legal criterion for admissibility, such factors can implicitly influence OTP strategic decision-making.",
    "output": "Article 17 focused judicial proceedings. Peace stability shaped ICC interventions. Stability not criterion. Factors influenced OTP decisions.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular past tense '-ed' to 'focus', 'form', 'influence'.",
      "Step 2: Segmented into four sentences for child-like structure.",
      "Step 3: Generalized verbs to simple past for consistency."
    ]
  },
  {
    "input": "The concept of 'positive complementarity' represents a shift from viewing complementarity primarily as a jurisdictional test to actively encouraging, supporting, and assisting national jurisdictions. This approach involves the ICC system working to enable states to fulfill their primary responsibility to investigate and prosecute Rome Statute crimes domestically.",
    "output": "Positive complementarity shifted to support jurisdictions. ICC system enabled states to investigate prosecute crimes.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Repeated subjects 'Positive complementarity' and 'ICC system'.",
      "Step 2: Simplified verbs to past tense 'shifted' and 'enabled'.",
      "Step 3: Split into two sentences to avoid pronoun ambiguity."
    ]
  },
  {
    "input": "The OTP's 2024 Policy on Complementarity and Cooperation formally consolidates this approach, framing the ICC not as an 'apex' court but as a 'hub' within a network of accountability efforts. The policy emphasizes partnership with states, civil society, and regional organizations, aiming to bring justice closer to affected communities.",
    "output": "2024 OTP Policy simplifies ICC as hub for accountability. It promotes partnerships for justice.",
    "technique": "Fine-Tuned Sequence-to-Sequence Simplification (AI)",
    "application_steps": [
      "Step 1: Treated as complex sentence for translation.",
      "Step 2: Substituted 'consolidates' with 'simplifies' and condensed clauses.",
      "Step 3: Rephrased to focus on hub role and partnerships."
    ]
  },
  {
    "input": "A significant challenge within the complementarity assessment is whether transitional justice mechanisms (TJMs) other than formal criminal prosecution, such as truth commissions or traditional justice rituals, can qualify as the type of national 'activity' that would render a case inadmissible under Article 17(1)(a) or (b). Scholarly opinion on this matter is divided, with some arguing for a narrow interpretation requiring criminal justice investigations.",
    "output": "Justice reversed: Article 17(1)(b) or (a) under inadmissible case render would 'activity' national of type the as qualify can rituals justice traditional or commissions truth as such prosecution criminal formal than other (TJMs) mechanisms justice transitional whether assessment complementarity the within challenge significant.",
    "technique": "Melodic Retrograde (Music)",
    "application_steps": [
      "Step 1: Treated sentence as a 'melody' of words.",
      "Step 2: Reversed word order to mimic retrograde (last word to first).",
      "Step 3: Kept punctuation for readability, producing absurd result."
    ]
  },
  {
    "input": "Blanket amnesties, particularly those granted by perpetrators to themselves or those that unconditionally absolve individuals of responsibility for genocide, crimes against humanity, or war crimes, are generally viewed as incompatible with the international legal obligation to combat impunity. Such measures could be interpreted as evidence of 'unwillingness' under Article 17.",
    "output": "Blanket amnesties, granted by perpetrators, absolve genocide, crimes against humanity, war crimes. Amnesties show unwillingness under Article 17.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split into two single-proposition sentences.",
      "Step 2: Separated amnesty action and unwillingness evidence.",
      "Step 3: Simplified wording for clarity."
    ]
  },
  {
    "input": "The ICC's approach in the Colombian situation suggests a significant degree of flexibility regarding sentencing outcomes within the complementarity assessment. It demonstrates a willingness to accept nationally-designed, context-specific justice solutions emerging from peace agreements, provided the underlying process meets the threshold of 'genuineness' in its intent and execution.",
    "output": "ICC approach Colombia flexibility sentencing. ICC accept justice solutions peace agreements. Process meet genuineness threshold.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles 'the' and 'a'.",
      "Step 2: Omitted prepositions 'of' and 'from'.",
      "Step 3: Simplified to telegraphic style."
    ]
  },
  {
    "input": "UN Security Council (UNSC) referrals under Article 13(b) of the Rome Statute, made pursuant to Chapter VII of the UN Charter, represent a powerful trigger for ICC jurisdiction, allowing the Court to investigate situations in states that are not parties. This mechanism effectively bypasses the need for the referred state's consent and can preempt potential admissibility challenges, particularly when the government is clearly unwilling to prosecute.",
    "output": "UNSC referrals trigger ICC jurisdiction slowly. Mechanism bypasses state consent gradually. Mechanism preempts challenges deliberately.",
    "technique": "Melodic Augmentation (Music)",
    "application_steps": [
      "Step 1: Treated sentence rhythm as musical notes.",
      "Step 2: 'Augmented' by adding adverbs (slowly, gradually, deliberately) to extend 'rhythmic values'.",
      "Step 3: Applied to segmented sentences for absurd effect."
    ]
  },
  {
    "input": "The International Criminal Court (ICC) operates as a court of last resort, intervening only when national courts are unwilling or unable to prosecute serious crimes like genocide, war crimes, and crimes against humanity. This principle, known as complementarity, is outlined in Article 17 of the Rome Statute.",
    "output": "ICC intervene courts unwilling unable prosecute crimes. Complementarity outlined Article 17.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified agent (ICC), action (intervene), and condition (courts unwilling).",
      "Step 2: Removed modifiers like 'court of last resort' and crime specifics.",
      "Step 3: Added second sentence for complementarity."
    ]
  },
  {
    "input": "Article 17 of the Rome Statute operationalizes the complementarity principle, setting out the specific conditions under which a case may be deemed inadmissible before the ICC. The core of Article 17 lies in its deference to genuine national proceedings, prioritizing the primary right and responsibility of states to investigate and prosecute the most serious crimes of international concern.",
    "output": "Article 17 set conditions case inadmissible. Article 17 defer genuine proceedings. States investigate serious crimes.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split into three single-proposition sentences.",
      "Step 2: Separated conditions, deference, and state responsibility.",
      "Step 3: Simplified each segment for clarity."
    ]
  },
  {
    "input": "A case is inadmissible if a state with jurisdiction is actively investigating or prosecuting it (Article 17(1)(a)), or if the state has investigated and decided not to prosecute (Article 17(1)(b)), or if the person has already been tried for the same conduct (Article 17(1)(c)). However, the ICC may still proceed if the state is found to be 'unwilling or unable genuinely' to carry out the investigation or prosecution. This 'unwilling or unable genuinely' test is the mechanism through which the ICC ensures that complementarity does not become a shield for impunity.",
    "output": "Case inadmissible state investigate prosecute. ICC proceed state unwilling unable genuinely.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles 'a' and 'the'.",
      "Step 2: Omitted conjunctions 'if' and 'or'.",
      "Step 3: Simplified to telegraphic style, retaining conditions."
    ]
  },
  {
    "input": "The very structure of the complementarity principle reflects an inherent tension, emerging as a compromise between delegations advocating for a court with strong jurisdiction to combat impunity and those prioritizing the protection of state sovereignty. This underlying tension inevitably shapes how the criteria for admissibility, particularly the assessment of 'unwillingness' and 'inability,' are interpreted and applied.",
    "output": "Complementarity showed tension between jurisdiction sovereignty. Tension shaped unwillingness inability.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular past tense '-ed' to 'reflect' and 'shape'.",
      "Step 2: Simplified to two sentences with generalized grammar.",
      "Step 3: Retained core tension and assessment focus."
    ]
  },
  {
    "input": "The ICC's mandate, as derived from the Rome Statute, is primarily focused on ending impunity for the perpetrators of the most serious crimes and contributing to the prevention of such crimes. The ICC primarily delivers retributive justice focused on individual criminal responsibility and punishment, which differs substantially from other transitional justice mechanisms.",
    "output": "ICC mandate end impunity crimes. ICC deliver justice punishment.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified agent (ICC), action (end), and patient (impunity).",
      "Step 2: Removed modifiers like 'most serious' and transitional justice details.",
      "Step 3: Added second sentence for justice focus."
    ]
  },
  {
    "input": "ICC jurisprudence has established that for national proceedings to preclude ICC admissibility, the state must demonstrate 'tangible, concrete and progressive' investigative or prosecutorial steps regarding the specific case. The 'case' is defined by the specific individual and substantially the same conduct alleged in the ICC proceedings.",
    "output": "State show tangible steps fast. Case define individual conduct quick.",
    "technique": "Melodic Diminution (Music)",
    "application_steps": [
      "Step 1: Treated sentence rhythm as musical notes.",
      "Step 2: 'Diminished' by adding adverbs (fast, quick) to shorten 'rhythmic values'.",
      "Step 3: Applied to segmented sentences for absurd effect."
    ]
  }
] [
  {
    "input": "Unwillingness, as defined in Article 17(2), considers whether national proceedings were undertaken to shield the person from ICC jurisdiction, or if there has been an unjustified delay inconsistent with an intent to bring the person to justice, or if proceedings were not conducted independently or impartially. This is described as a subjective criterion, pertaining to a State’s intentions, and is thus challenging to prove.",
    "output": "Void",
    "technique": "Redundant Phrase Elimination (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive legal phrases such as 'unjustified delay inconsistent with an intent to bring the person to justice'.",
      "Step 2: Consolidated the phrase to a single term 'void' to eliminate redundancy.",
      "Step 3: Ensured the output retains the core legal implication of invalidity."
    ]
  },
  {
    "input": "Inability, as defined in Article 17(3), considers whether, due to a total or substantial collapse or unavailability of the national judicial system, the State cannot obtain the accused, necessary evidence and testimony, or otherwise carry out its proceedings. This criterion reflects an objective assessment of the State's factual capacity to handle the case.",
    "output": "The State cannot handle the case due to a collapsed judicial system.",
    "technique": "Active Voice Conversion (Legal)",
    "application_steps": [
      "Step 1: Identified passive construction 'the State cannot obtain the accused, necessary evidence and testimony'.",
      "Step 2: Converted to active voice by emphasizing the State's inability as the actor.",
      "Step 3: Simplified the clause to directly state the outcome of the collapsed system."
    ]
  },
  {
    "input": "The term 'genuinely' qualifies both 'unwilling' and 'unable' in Article 17(1)(a) and (b), signifying that the assessment goes beyond mere appearances and requires an evaluation of the bona fides of the national proceedings. A 'genuine' investigation or prosecution implies a real commitment by the state to bring perpetrators to justice.",
    "output": "Evaluate the state's commitment to prosecute.",
    "technique": "Nominalization Reversal (Legal)",
    "application_steps": [
      "Step 1: Identified nominalizations like 'evaluation of the bona fides' and 'commitment'.",
      "Step 2: Converted nouns to verbs, changing 'evaluation' to 'evaluate' and 'commitment' to 'commit'.",
      "Step 3: Simplified the sentence to focus on the action of evaluating the state's prosecution efforts."
    ]
  },
  {
    "input": "Beyond the admissibility criteria in Article 17, Article 53 provides the ICC Prosecutor with a distinct ground for potentially halting proceedings: the 'interests of justice'. Even if a situation falls within the Court's jurisdiction and a potential case appears admissible, the Prosecutor may decline to investigate or prosecute if doing so would not serve these interests.",
    "output": "Define 'Justice Interests' as the Prosecutor's basis for halting proceedings. If a case is admissible, the Prosecutor may stop Justice Interests if they are not served.",
    "technique": "Strategic Term Definition and Compression (Legal)",
    "application_steps": [
      "Step 1: Identified repetitive phrase 'interests of justice'.",
      "Step 2: Defined it as 'Justice Interests' for brevity.",
      "Step 3: Replaced subsequent references with the defined term and condensed the sentence."
    ]
  },
  {
    "input": "A significant debate exists regarding whether the 'interests of justice' assessment can legitimately encompass broader considerations, particularly those related to peace and security. The OTP's 2007 policy paper acknowledged this debate and suggested a willingness to consider 'various national and international efforts to achieve peace and security' as a factor, while historically exercising caution in explicitly invoking Article 53 based on peace considerations.",
    "output": "Debate exist. Interests justice assessment encompass peace security. OTP 2007 paper suggest consider national international efforts achieve peace security. Caution invoke Article 53 peace.",
    "technique": "Function Word Omission (Child Language)",
    "application_steps": [
      "Step 1: Removed articles like 'a' and 'the'.",
      "Step 2: Omitted auxiliary verbs such as 'can' and 'to'.",
      "Step 3: Stripped prepositions and conjunctions like 'of' and 'and' to mimic telegraphic speech."
    ]
  },
  {
    "input": "The ICC does not automatically deem a case inadmissible simply because a peace process is underway; rather, it scrutinizes the concrete impact of that process on the likelihood of genuine national accountability proceedings for the specific case before it. Early-stage negotiations or agreements with uncertain implementation prospects are unlikely to meet the Article 17 threshold for inadmissibility.",
    "output": "ICC scrutinizes peace process impact on accountability proceedings.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (ICC), action (scrutinizes), and patient (peace process impact).",
      "Step 2: Removed modifiers and subordinate clauses like 'simply because' and 'early-stage negotiations'.",
      "Step 3: Preserved core semantic components in a simplified structure."
    ]
  },
  {
    "input": "Conversely, a well-established and functioning mechanism born from a peace process, demonstrably undertaking genuine proceedings relevant to potential ICC cases, can lead to a finding of inadmissibility. The closure of Colombia’s preliminary examination in 2021 reflected confidence in its Special Jurisdiction for Peace (JEP) and other national mechanisms as genuine national efforts.",
    "output": "Peace process mechanism undertakes genuine proceedings. Colombia’s examination closed. Special Jurisdiction for Peace genuine.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Broke complex sentence into three single-proposition sentences.",
      "Step 2: Separated clauses about mechanism, Colombia’s examination, and JEP.",
      "Step 3: Simplified each segment to convey one idea clearly."
    ]
  },
  {
    "input": "While Article 17 focuses on the status and genuineness of national judicial proceedings, broader concerns about peace and stability often form an unavoidable backdrop to ICC interventions. Although stability is not an explicit legal criterion for admissibility, such factors can implicitly influence OTP strategic decision-making.",
    "output": "Article 17 focus status genuineness judicial proceedings. Peace stability concerns backdrop ICC interventions. Stability not legal criterion. Factors influence OTP decision-making.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split the input into four distinct sentences based on propositions.",
      "Step 2: Separated clauses about Article 17, peace concerns, stability criterion, and OTP influence.",
      "Step 3: Ensured each sentence conveys a single idea for clarity."
    ]
  },
  {
    "input": "The concept of 'positive complementarity' represents a shift from viewing complementarity primarily as a jurisdictional test to actively encouraging, supporting, and assisting national jurisdictions. This approach involves the ICC system working to enable states to fulfill their primary responsibility to investigate and prosecute Rome Statute crimes domestically.",
    "output": "Positive complementarity shifted to encouraging jurisdictions. ICC system enabled states to investigated and prosecuted crimes.",
    "technique": "Rule Generalization (Adapted Over-regularization) (Child Language)",
    "application_steps": [
      "Step 1: Applied regular past tense '-ed' to irregular verbs 'shift' and 'enable'.",
      "Step 2: Generalized 'investigate' and 'prosecute' to past tense 'investigated' and 'prosecuted'.",
      "Step 3: Simplified sentence structure to reflect over-regularized grammar."
    ]
  },
  {
    "input": "The OTP's 2024 Policy on Complementarity and Cooperation formally consolidates this approach, framing the ICC not as an 'apex' court but as a 'hub' within a network of accountability efforts. The policy emphasizes partnership with states, civil society, and regional organizations, aiming to bring justice closer to affected communities.",
    "output": "OTP's 2024 Policy consolidated approach. OTP's 2024 Policy framed ICC as hub. OTP's 2024 Policy emphasized partnership. OTP's 2024 Policy aimed to bring justice.",
    "technique": "Explicit Subject Repetition (Child Language)",
    "application_steps": [
      "Step 1: Replaced pronouns with full noun phrase 'OTP's 2024 Policy'.",
      "Step 2: Repeated the subject in each segmented sentence to avoid ambiguity.",
      "Step 3: Broke the input into four sentences for clarity."
    ]
  },
  {
    "input": "A significant challenge within the complementarity assessment is whether transitional justice mechanisms (TJMs) other than formal criminal prosecution, such as truth commissions or traditional justice rituals, can qualify as the type of national 'activity' that would render a case inadmissible under Article 17(1)(a) or (b). Scholarly opinion on this matter is divided, with some arguing for a narrow interpretation requiring criminal justice investigations.",
    "output": "The challenge is whether TJMs qualify as national activity under Article 17. TJMs include truth commissions and justice rituals. Scholars argue for criminal investigations.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Divided the complex sentence into three simpler sentences.",
      "Step 2: Separated the challenge, TJM definition, and scholarly opinion into distinct propositions.",
      "Step 3: Simplified wording to focus on core ideas."
    ]
  },
  {
    "input": "Blanket amnesties, particularly those granted by perpetrators to themselves or those that unconditionally absolve individuals of responsibility for genocide, crimes against humanity, or war crimes, are generally viewed as incompatible with the international legal obligation to combat impunity. Such measures could be interpreted as evidence of 'unwillingness' under Article 17.",
    "output": "Blanket amnesties absolve perpetrators of genocide and war crimes. Amnesties show unwillingness under Article 17.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (amnesties), action (absolve), and patient (perpetrators).",
      "Step 2: Stripped modifiers like 'particularly those granted by perpetrators to themselves'.",
      "Step 3: Retained core relationship and added second sentence for unwillingness."
    ]
  },
  {
    "input": "The ICC's approach in the Colombian situation suggests a significant degree of flexibility regarding sentencing outcomes within the complementarity assessment. It demonstrates a willingness to accept nationally-designed, context-specific justice solutions emerging from peace agreements, provided the underlying process meets the threshold of 'genuineness' in its intent and execution.",
    "output": "ICC's approach in Colombia showed flexibility in sentencing. ICC accepted national justice solutions from peace agreements. Process met genuineness threshold.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split the input into three single-proposition sentences.",
      "Step 2: Separated flexibility, acceptance of solutions, and genuineness threshold.",
      "Step 3: Simplified each segment for clarity and brevity."
    ]
  },
  {
    "input": "UN Security Council (UNSC) referrals under Article 13(b) of the Rome Statute, made pursuant to Chapter VII of the UN Charter, represent a powerful trigger for ICC jurisdiction, allowing the Court to investigate situations in states that are not parties. This mechanism effectively bypasses the need for the referred state's consent and can preempt potential admissibility challenges, particularly when the government is clearly unwilling to prosecute.",
    "output": "UNSC referrals under Article 13(b) triggered ICC jurisdiction. Referrals bypassed state consent. Referrals preempted admissibility challenges.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Divided the complex sentence into three simpler sentences.",
      "Step 2: Separated jurisdiction trigger, consent bypass, and admissibility preemption.",
      "Step 3: Simplified wording to focus on core actions."
    ]
  },
  {
    "input": "The International Criminal Court (ICC) operates as a court of last resort, intervening only when national courts are unwilling or unable to prosecute serious crimes like genocide, war crimes, and crimes against humanity. This principle, known as complementarity, is outlined in Article 17 of the Rome Statute.",
    "output": "ICC intervenes when national courts fail to prosecute serious crimes. Complementarity is outlined in Article 17.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (ICC), action (intervenes), and condition (courts fail).",
      "Step 2: Removed modifiers like 'court of last resort' and specific crime lists.",
      "Step 3: Added second sentence to preserve complementarity reference."
    ]
  },
  {
    "input": "Article 17 of the Rome Statute operationalizes the complementarity principle, setting out the specific conditions under which a case may be deemed inadmissible before the ICC. The core of Article 17 lies in its deference to genuine national proceedings, prioritizing the primary right and responsibility of states to investigate and prosecute the most serious crimes of international concern.",
    "output": "Article 17 set conditions for case inadmissibility. Article 17 deferred to genuine national proceedings. States investigated serious crimes.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split the input into three single-proposition sentences.",
      "Step 2: Separated conditions, deference, and state responsibility.",
      "Step 3: Simplified each segment to convey one idea clearly."
    ]
  },
  {
    "input": "A case is inadmissible if a state with jurisdiction is actively investigating or prosecuting it (Article 17(1)(a)), or if the state has investigated and decided not to prosecute (Article 17(1)(b)), or if the person has already been tried for the same conduct (Article 17(1)(c)). However, the ICC may still proceed if the state is found to be 'unwilling or unable genuinely' to carry out the investigation or prosecution. This 'unwilling or unable genuinely' test is the mechanism through which the ICC ensures that complementarity does not become a shield for impunity.",
    "output": "Case inadmissible if state investigated. Case inadmissible if state decided not prosecute. Case inadmissible if person tried. ICC proceeded if state unwilling unable genuinely.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Broke complex sentence into four single-proposition sentences.",
      "Step 2: Separated each inadmissibility condition and ICC proceeding condition.",
      "Step 3: Simplified wording to focus on core ideas."
    ]
  },
  {
    "input": "The very structure of the complementarity principle reflects an inherent tension, emerging as a compromise between delegations advocating for a court with strong jurisdiction to combat impunity and those prioritizing the protection of state sovereignty. This underlying tension inevitably shapes how the criteria for admissibility, particularly the assessment of 'unwillingness' and 'inability,' are interpreted and applied.",
    "output": "Complementarity reflected tension. Tension shaped unwillingness inability assessment.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (complementarity), action (reflected), and patient (tension).",
      "Step 2: Stripped modifiers like 'inherent' and delegate details.",
      "Step 3: Added second sentence to preserve tension's impact on assessment."
    ]
  },
  {
    "input": "The ICC's mandate, as derived from the Rome Statute, is primarily focused on ending impunity for the perpetrators of the most serious crimes and contributing to the prevention of such crimes. The ICC primarily delivers retributive justice focused on individual criminal responsibility and punishment, which differs substantially from other transitional justice mechanisms.",
    "output": "ICC's mandate ended impunity for serious crimes. ICC delivered retributive justice.",
    "technique": "Core Argument Structure Preservation (Child Language)",
    "application_steps": [
      "Step 1: Identified main agent (ICC), action (ended), and patient (impunity).",
      "Step 2: Removed modifiers like 'most serious' and transitional justice comparison.",
      "Step 3: Added second sentence to preserve justice delivery focus."
    ]
  },
  {
    "input": "ICC jurisprudence has established that for national proceedings to preclude ICC admissibility, the state must demonstrate 'tangible, concrete and progressive' investigative or prosecutorial steps regarding the specific case. The 'case' is defined by the specific individual and substantially the same conduct alleged in the ICC proceedings.",
    "output": "State demonstrated tangible steps to preclude ICC admissibility. State investigated specific individual and conduct.",
    "technique": "Sentence Segmentation (Child Language)",
    "application_steps": [
      "Step 1: Split the input into two single-proposition sentences.",
      "Step 2: Separated demonstration of steps and case definition.",
      "Step 3: Simplified wording to focus on core actions."
    ]
  }
]
